[{"job_title": "Junior Gameplay Programmer ", "date": "2018-11-03 14:30:06.0", "description": "Passionate about game development? Our client is launching a new game and they are looking for you to join their team to develop a world-class game. If you have dreamed about creating your own game someday, this might be the job for you! Kuvaus Academic Work is looking for Junior Gameplay Programmer for our client Shipyard. You will be recruited to our client company. Academic Work will take care of the recruitment process, therefore candidates are kindly asked to direct all questions to Academic Work [hel03@academicwork. fi hel03@academicwork. fi/ Työtehtävät In this position, you will be part of creating this new, location-based game. The idea is that you will be part of every step when creating a game. This means that youll be involved with the games graphics, gameplay and UI as well as the design. The team uses Native iOS technologies, such as Objective-C, C++ and SceneKit among all others. The team consists of four experienced developers and one artist, so youll get a deep introduction to the world of games. This position suits you who lives, breathes and loves games. Etsimämme henkilö on ur ideal candidate has some own game projects done to show your passion for gaming. Alternatively, you have already worked as a game programmer. In addition, some UI-experience is highly valued. You do have some experience in programming, but we dont expect you to have any particular language experience. But Swift and/or Objective-C are a huge advantage! Apply for this position if you have: •   Game projects of your own or some work experience (few internships or summer jobs in relevant positions) •   Some UI experience •   True passion towards mobile game industry Start: As soon as possible Working hours: Full-time Employment period: Permanent Location: Helsinki, Centrum Salary: According to an agreement Published: 2. 11. 2018 To apply for the job you need to register on our website and then click on Apply here. Remember to attach your CV into your application! We only process applications through our website but if you have questions about the position you can reach us via email in hel03@academicwork. fi Please write the advert ID in the subject field and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please note that the advert can be removed prior to the last application dates on our external advertising pages. In the event the advert has been removed it is either due to the process being completed or because we have a sufficient number of qualified applications and are proceeding to the selection/interview phase in the process. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi Infoa asiakkaasta Shipyard is a pioneering location-based game company. They started to build the future of gaming almost ten years ago but the world was not ready for them yet. Now they are back and on a mission to build world-class location-based games for mobile. Shipyard Games is a fresh new mobile gaming studio. The office is located in Finland, in the beautiful city of Helsinki that is home to some of the top talent in gaming. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15016217", "company": ""}, {"job_title": "Junior Gameplay Programmer ", "date": "2018-11-03 14:30:06.0", "description": "Passionate about game development? Our client is launching a new game and they are looking for you to join their team to develop a world-class game. If you have dreamed about creating your own game someday, this might be the job for you! Kuvaus Academic Work is looking for Junior Gameplay Programmer for our client Shipyard. You will be recruited to our client company. Academic Work will take care of the recruitment process, therefore candidates are kindly asked to direct all questions to Academic Work [hel03@academicwork. fi hel03@academicwork. fi/ Työtehtävät In this position, you will be part of creating this new, location-based game. The idea is that you will be part of every step when creating a game. This means that youll be involved with the games graphics, gameplay and UI as well as the design. The team uses Native iOS technologies, such as Objective-C, C++ and SceneKit among all others. The team consists of four experienced developers and one artist, so youll get a deep introduction to the world of games. This position suits you who lives, breathes and loves games. Etsimämme henkilö on ur ideal candidate has some own game projects done to show your passion for gaming. Alternatively, you have already worked as a game programmer. In addition, some UI-experience is highly valued. You do have some experience in programming, but we dont expect you to have any particular language experience. But Swift and/or Objective-C are a huge advantage! Apply for this position if you have: •   Game projects of your own or some work experience (few internships or summer jobs in relevant positions) •   Some UI experience •   True passion towards mobile game industry Start: As soon as possible Working hours: Full-time Employment period: Permanent Location: Helsinki, Centrum Salary: According to an agreement Published: 2. 11. 2018 To apply for the job you need to register on our website and then click on Apply here. Remember to attach your CV into your application! We only process applications through our website but if you have questions about the position you can reach us via email in hel03@academicwork. fi Please write the advert ID in the subject field and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please note that the advert can be removed prior to the last application dates on our external advertising pages. In the event the advert has been removed it is either due to the process being completed or because we have a sufficient number of qualified applications and are proceeding to the selection/interview phase in the process. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi Infoa asiakkaasta Shipyard is a pioneering location-based game company. They started to build the future of gaming almost ten years ago but the world was not ready for them yet. Now they are back and on a mission to build world-class location-based games for mobile. Shipyard Games is a fresh new mobile gaming studio. The office is located in Finland, in the beautiful city of Helsinki that is home to some of the top talent in gaming. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15016217", "company": ""}, {"job_title": "Junior Server Programmer ", "date": "2018-10-04 14:19:54.0", "description": "Wargaming’s mobile team in Helsinki is looking for a Junior Server Programmer to provide players with a seamless gameplay experience through a network of reliable tools and services. You’ll join a nimble team and sharing the goal of building an unrivaled set of back-end services and functionality that will be the basis of the tech behind Wargaming’s mobile products. The Junior Server Programmer will report to the Lead Server Architect What you will do: Work with the other server developers Implement, deploy, and maintain highly scalable and available back-ends for live games Deploy and improve upon game functionality common to multiple games in a reusable way Who are you: Proven ability to be a team player A genuine passion for games Well established programming skills Strong desire to learn, develop and fine-tune your skill set What additional skills will help you stand out? Familiarity with our technologies such as Scala, AWS, DynamoDB (or similar ones) Experience developing servers or APIs Database experience (NoSQL or SQL) Knowledge of several different programming languages Familiarity with functional programming What we offer at Wargaming Helsinki: Opportunity to work with an experienced, humble and nimble development team with one mission: Make. Legendary. Games. Great potential for and support for growth; attending events/meetups, opportunities and encouragement to test out new technologies as well as collaborating with experienced Wargamers across the world Autonomy and independence: take decisions without layers of management or bureaucracy You’ll be part of the international Wargaming ecosystem Competitive compensation and benefits plan Work in an open and friendly office environment in the center of Helsinki To learn more about our Helsinki Studio and what we are looking for in job applicants, have a look at this article: http: //www. pocketgamer. biz/interview/67476/how-to-get-a-job-at-wargaming-helsinki/ To apply, use Monster link", "company": ""}, {"job_title": "3D Artist ", "date": "2018-09-10 08:13:01.0", "description": "3D Artist, Hisome, Helsinki, kokoaikatyö, Kesto: yli 12 kuukauttaPlayStack Helsinki is a game development studio working on a revolutionary game! We re now hiring a top notch experienced 3D artist to join our newly founded offices in the very center of Helsinki. PlayStack Helsinki is part of the PlayStack group which provides new kind of publishing and funding services for game developers and has offices in London and Warsaw and now Helsinki. Join our very nice. . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": ""}, {"job_title": "3D Artist ", "date": "2018-09-10 08:13:01.0", "description": "3D Artist, Hisome, Helsinki, kokoaikatyö, Kesto: yli 12 kuukauttaPlayStack Helsinki is a game development studio working on a revolutionary game! We re now hiring a top notch experienced 3D artist to join our newly founded offices in the very center of Helsinki. PlayStack Helsinki is part of the PlayStack group which provides new kind of publishing and funding services for game developers and has offices in London and Warsaw and now Helsinki. Join our very nice. . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": ""}, {"job_title": "Game Programmer / Unity Developer ", "date": "2019-01-13 18:54:35.0", "description": "Game Programmer / Unity Developer, Barona Oy, Barona IT Oy, Helsinki. Game Programmer / Unity Developer, Barona Oy, Helsinki , Haku päättyy: 31. 01. 2019 klo 23: 59, kokoaikatyö, Kesto: yli 12 kuukautta Is your love of games and desire to shape the future of mobile gaming evident from your previous body of work? Does your eye for technological detail and flawless design leave a trail of dropped jaws wherever you go? Is your understanding of the app development cycle - from idea generation to development to commercialization - on the nextest of levels?Well, you re in luck! We re on a mission to . . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Barona Oy"}, {"job_title": "Game Programmer / Unity Developer ", "date": "2019-01-13 18:54:35.0", "description": "Game Programmer / Unity Developer, Barona Oy, Barona IT Oy, Helsinki. Game Programmer / Unity Developer, Barona Oy, Helsinki , Haku päättyy: 31. 01. 2019 klo 23: 59, kokoaikatyö, Kesto: yli 12 kuukautta Is your love of games and desire to shape the future of mobile gaming evident from your previous body of work? Does your eye for technological detail and flawless design leave a trail of dropped jaws wherever you go? Is your understanding of the app development cycle - from idea generation to development to commercialization - on the nextest of levels?Well, you re in luck! We re on a mission to . . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Barona Oy"}, {"job_title": "Game Programmer ", "date": "2019-04-05 23:42:35.0", "description": "Game Programmer, Next Games Oy, Helsinki. Game Programmer, Next Games Oy, Helsinki , Haku päättyy: 21. 04. 2019 klo 23: 59, kokoaikatyö, full time, Kesto: yli 12 kuukautta, permanent We are looking for a Game Programmer to work with our talented and experienced developers. If you have the dedication and skills that we are looking for, this is a unique opportunity to work with some of the world s best-known IPs such as The Walking Dead and Blade Runner, as well as some other exciting projects that will be publicly announced at a later time. As a Game Programmer you are respons. . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Next Games Oy"}, {"job_title": "Game Programmer ", "date": "2019-04-05 23:42:35.0", "description": "Game Programmer, Next Games Oy, Helsinki. Game Programmer, Next Games Oy, Helsinki , Haku päättyy: 21. 04. 2019 klo 23: 59, kokoaikatyö, full time, Kesto: yli 12 kuukautta, permanent We are looking for a Game Programmer to work with our talented and experienced developers. If you have the dedication and skills that we are looking for, this is a unique opportunity to work with some of the world s best-known IPs such as The Walking Dead and Blade Runner, as well as some other exciting projects that will be publicly announced at a later time. As a Game Programmer you are respons. . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Next Games Oy"}, {"job_title": "HTML5 Game Programmer ", "date": "2019-01-24 14:30:07.0", "description": "HTML5 Game Programmer, Helsinki Paf Game Studio is looking for a Game Programmer with passion to games. You are self-motivated, goal-oriented and a strong team player. You can visualize how things should work, and how to translate this into a functioning solution. You take pride in your work and know what it means to take responsibility and deliver quality focused products. Come to work in a team of professionals that drives the development of a product, from the initial proof of concept, through continually tweaking the game experience, to the polishing of the final product. And most of all, have fun doing all that! We trust in each other s skills and value each other s work. If this sounds appealing to you, then join a team of equally enthusiastic game developers and bring your visions into reality! RESPONSIBILITIES HTML5 Game development for Mobile and Desktop browsers Contributing to the Game Studio Developers meetings and driving proof-of-concepts and improvement ideas KEY SKILLS: Experience in game development Passion for games, coding and problem solving Strong JavaScript programming skills Mastering some of JavaScript supersets Experience with both frontend and backend Thirst to learn BENEFICIAL SKILLS: Experience using canvas/webgl/Pixi. js/CreateJS Experience with working Spine 2D animations Experience with different particle systems Knowledge about user interface (UI) and user experience (UX) Since our working language is English, we require good English knowledge, both written and verbal, paired with skills in clear and effective communication. In return we offer a key position with direct influence on the game, fun and motivated team mates, a competitive salary and benefits package. Our studio is in the heart of Helsinki. Interested? Submit your application including a link to your possible work samples on-line by February 12th, 2019. All communication and applications will be treated confidentially. For more information, please contact our recruitment partner Arja Martikainen arja. martikainen(at)barona. fi or call +358 40 7621564 on weekdays between 2 and 3 pm. Edellytykset työnsaannille: HTML5, game development, JavaScript, Front-end, Back-end Eduksi luettavat asiat: mobile, desktop, Canvas, WebGL, Pixi. js, CreateJS, Spine, UI, UX Apply latest by 12. 02. 2019 on our site. Or for more information please contact: arja. martikainen@barona. fi , 0407621564 Ålands Penningautomatförening Paf is a Nordic gaming company founded on Åland in 1966 to generate profit for the benefit of society. We were one of the very first gaming companies to go online in 1999. Many of our games on Paf. com are exclusive to Paf and developed by our in-house Games Studio. We are an award-winning industry leader in responsible gaming. Our physical gaming operations include over 30 cruise ships criss-crossing the Baltic and North Seas. Paf has roughly 400 employees representing over 30 nationalities. Our offices are located on Åland, in Helsinki, Stockholm, Riga, Tallinn, Oslo, Norrköping and Madrid. Paf (Ålands Penningautomatförening) is licensed and controlled by the Government of Åland. In 2017, the Paf Group had a total revenue of 116. 5 million euros and a profit of 29. 4 million euros. Rekrytointia hoitaa Barona This recruitment is conducted in partnership with Barona. We are a bold expert on working life and a trusted partner in talent acquisition from start-ups to large corporations. We recruit approximately 12, 500 professionals annually in various industries in Finland and internationally.", "company": ""}, {"job_title": "HTML5 Game Programmer ", "date": "2019-01-24 14:30:07.0", "description": "HTML5 Game Programmer, Helsinki Paf Game Studio is looking for a Game Programmer with passion to games. You are self-motivated, goal-oriented and a strong team player. You can visualize how things should work, and how to translate this into a functioning solution. You take pride in your work and know what it means to take responsibility and deliver quality focused products. Come to work in a team of professionals that drives the development of a product, from the initial proof of concept, through continually tweaking the game experience, to the polishing of the final product. And most of all, have fun doing all that! We trust in each other s skills and value each other s work. If this sounds appealing to you, then join a team of equally enthusiastic game developers and bring your visions into reality! RESPONSIBILITIES HTML5 Game development for Mobile and Desktop browsers Contributing to the Game Studio Developers meetings and driving proof-of-concepts and improvement ideas KEY SKILLS: Experience in game development Passion for games, coding and problem solving Strong JavaScript programming skills Mastering some of JavaScript supersets Experience with both frontend and backend Thirst to learn BENEFICIAL SKILLS: Experience using canvas/webgl/Pixi. js/CreateJS Experience with working Spine 2D animations Experience with different particle systems Knowledge about user interface (UI) and user experience (UX) Since our working language is English, we require good English knowledge, both written and verbal, paired with skills in clear and effective communication. In return we offer a key position with direct influence on the game, fun and motivated team mates, a competitive salary and benefits package. Our studio is in the heart of Helsinki. Interested? Submit your application including a link to your possible work samples on-line by February 12th, 2019. All communication and applications will be treated confidentially. For more information, please contact our recruitment partner Arja Martikainen arja. martikainen(at)barona. fi or call +358 40 7621564 on weekdays between 2 and 3 pm. Edellytykset työnsaannille: HTML5, game development, JavaScript, Front-end, Back-end Eduksi luettavat asiat: mobile, desktop, Canvas, WebGL, Pixi. js, CreateJS, Spine, UI, UX Apply latest by 12. 02. 2019 on our site. Or for more information please contact: arja. martikainen@barona. fi , 0407621564 Ålands Penningautomatförening Paf is a Nordic gaming company founded on Åland in 1966 to generate profit for the benefit of society. We were one of the very first gaming companies to go online in 1999. Many of our games on Paf. com are exclusive to Paf and developed by our in-house Games Studio. We are an award-winning industry leader in responsible gaming. Our physical gaming operations include over 30 cruise ships criss-crossing the Baltic and North Seas. Paf has roughly 400 employees representing over 30 nationalities. Our offices are located on Åland, in Helsinki, Stockholm, Riga, Tallinn, Oslo, Norrköping and Madrid. Paf (Ålands Penningautomatförening) is licensed and controlled by the Government of Åland. In 2017, the Paf Group had a total revenue of 116. 5 million euros and a profit of 29. 4 million euros. Rekrytointia hoitaa Barona This recruitment is conducted in partnership with Barona. We are a bold expert on working life and a trusted partner in talent acquisition from start-ups to large corporations. We recruit approximately 12, 500 professionals annually in various industries in Finland and internationally.", "company": ""}, {"job_title": "Developer Trainee ", "date": "2019-02-05 14:30:06.0", "description": "Are you passionate for technology and coding and you want to become our next coding ninja? Convince us by your outstanding CV where you bring out your interests, motivation factors and also expectations for your work and the team. Telia summer trainee program provides a great opportunity to jump start your career – over a third of our trainees continues after the summer period. Get inspired by our New Generation Telco journey and join the team! We offer a full time position (38 h/week) for the period of 1. 5. –31. 8. 2019 in Helsinki office (Vallila). In this role you will be part of our Frontend Development & Platforms team and based on your skills you will get to work with: - Frontend development (React, React Native) - Backend development (Node. js, GraphQL, Event Driven Microservices) - Testing & test automation (TDD, BDD) - DevOps & Scrum methods WHAT WE OFFER During the summer, you will collect essential experience for your future career. In this position you get the chance to build future Digital Services based on Cloud native environments, React applications and Event Driven Microservice architecture. You will get a chance to work with and learn from senior programmers. We provide a flexible and modern workspace, relaxed work atmosphere, great colleagues and interesting board game nights along with other Telia activities. After the summer, depending on company and candidate needs there might be an opportunity to continue the work in one form or another (eg. Thesis, part-time, full-time). WHAT WE EXPECT FROM YOU You have already some experience in React, Node. JS (or relevant) programming and you are eager to learn more. You are proactive and forward-thinking person, who is interested in solving problems. In order to succeed in this position, you have to be a team player, because part of our work consists of pair-programming. You should have good communication skills, especially in English, but Finnish is also appreciated. We deeply care about quality, for that reason you should be positive about testing your own and others code, and also documenting things systematically and professionally. YOUR DAY MIGHT LOOK LIKE THIS You come to work flexibly around 7-9 and leave around 15-17, depending on the start and your pair. During the day you will have some Scrum meetings, like daily stand-up, retrospective, demonstrations, planning and lunch in a great company in addition to a lot of coding. INTERESTED? We will going through the candidates during the application process so please do not hesitate to send us your application early! Send us your personalized CV and cover letter via our recruitment system no later than 10. 2. 2019. - https: //www. telia. fi/career/avoimet-tyopaikat For more information please visit our Facebook group, where we share crucial information about application process. You can also contact Marianna (manager) and ask more about the position: Marianna Chekurova (Head of Frontend development) 040-3023650 15. 1. -18. 1. 2019 at 15-16, 28. 1. - 8. 2. at 14-15. #teliakesä #VKD19", "company": ""}, {"job_title": "Developer Trainee ", "date": "2019-02-05 14:30:06.0", "description": "Are you passionate for technology and coding and you want to become our next coding ninja? Convince us by your outstanding CV where you bring out your interests, motivation factors and also expectations for your work and the team. Telia summer trainee program provides a great opportunity to jump start your career – over a third of our trainees continues after the summer period. Get inspired by our New Generation Telco journey and join the team! We offer a full time position (38 h/week) for the period of 1. 5. –31. 8. 2019 in Helsinki office (Vallila). In this role you will be part of our Frontend Development & Platforms team and based on your skills you will get to work with: - Frontend development (React, React Native) - Backend development (Node. js, GraphQL, Event Driven Microservices) - Testing & test automation (TDD, BDD) - DevOps & Scrum methods WHAT WE OFFER During the summer, you will collect essential experience for your future career. In this position you get the chance to build future Digital Services based on Cloud native environments, React applications and Event Driven Microservice architecture. You will get a chance to work with and learn from senior programmers. We provide a flexible and modern workspace, relaxed work atmosphere, great colleagues and interesting board game nights along with other Telia activities. After the summer, depending on company and candidate needs there might be an opportunity to continue the work in one form or another (eg. Thesis, part-time, full-time). WHAT WE EXPECT FROM YOU You have already some experience in React, Node. JS (or relevant) programming and you are eager to learn more. You are proactive and forward-thinking person, who is interested in solving problems. In order to succeed in this position, you have to be a team player, because part of our work consists of pair-programming. You should have good communication skills, especially in English, but Finnish is also appreciated. We deeply care about quality, for that reason you should be positive about testing your own and others code, and also documenting things systematically and professionally. YOUR DAY MIGHT LOOK LIKE THIS You come to work flexibly around 7-9 and leave around 15-17, depending on the start and your pair. During the day you will have some Scrum meetings, like daily stand-up, retrospective, demonstrations, planning and lunch in a great company in addition to a lot of coding. INTERESTED? We will going through the candidates during the application process so please do not hesitate to send us your application early! Send us your personalized CV and cover letter via our recruitment system no later than 10. 2. 2019. - https: //www. telia. fi/career/avoimet-tyopaikat For more information please visit our Facebook group, where we share crucial information about application process. You can also contact Marianna (manager) and ask more about the position: Marianna Chekurova (Head of Frontend development) 040-3023650 15. 1. -18. 1. 2019 at 15-16, 28. 1. - 8. 2. at 14-15. #teliakesä #VKD19", "company": ""}, {"job_title": "Product Manager ", "date": "2018-10-01 10:02:57.0", "description": "We are EA And we make games – how cool is that? In fact, we entertain millions of people across the globe with the most amazing and immersive interactive software in the industry. But making games is hard work. That’s why we employ the most creative, passionate people in the industry. The Challenge Ahead tracktwenty is Electronics Arts mobile game studio based in the centre of Helsinki. The studio is responsible for bringing SimCity BuildIt to tablet and mobile and the game has more than 100 million installs to date. As well as growing SimCity BuildIt, the studios experienced team of programmers, artists, designers, marketers and analysts are working to create the next big hit to come out of Finland for EA Mobile. The Product Manager will have a key role in building one of the most popular gaming franchises in the history of computer games, SimCity. We are seeking people who are motivated, self-driven and have experience from a similar role in other games or software projects. Responsibilities: Work closely with product stakeholders to provide input on live product performance and feedback on product roadmap. Analyze and monitor game performance on a daily basis. Develop and test hypotheses to improve all game KPIs with A/B testing, in game promotions and sales. Turn data into learnings and make recommendations for the game team to continuously improve our games. Work closely with Analytics team to define and implement telemetry/tracking events, reporting and data visualization tools. Required skills: Strong analytics and problem-solving skills. Proactive and creative approach to always find the truth behind the numbers. Experience with data driven decision-making processes. Ability to work independently in ambiguous and fast-paced work environments. Strong team communicator with an ability to negotiate and unite subject experts to tackle complex problems. Excellent written and verbal communications in English, ability to effectively and systematically use data to support recommendations. A strong passion for games is a MUST. Great attention to detail and strong focus on the essential Great Excel + Powerpoint skills, experience working with SQL and R or statistical tools are an asset. A thirst for continuous learning and improving our understanding of how great games work. Required work & education: Bachelor’s degree in quantitative discipline preferred. For example: Business/Math/Statistics/Industrial Management/Finance/Computer Science degrees Direct experience working on live free-to-play games is preferred. Experience working with a related field like developing consumer facing Products", "company": ""}, {"job_title": "Product Manager ", "date": "2018-10-01 10:02:57.0", "description": "We are EA And we make games – how cool is that? In fact, we entertain millions of people across the globe with the most amazing and immersive interactive software in the industry. But making games is hard work. That’s why we employ the most creative, passionate people in the industry. The Challenge Ahead tracktwenty is Electronics Arts mobile game studio based in the centre of Helsinki. The studio is responsible for bringing SimCity BuildIt to tablet and mobile and the game has more than 100 million installs to date. As well as growing SimCity BuildIt, the studios experienced team of programmers, artists, designers, marketers and analysts are working to create the next big hit to come out of Finland for EA Mobile. The Product Manager will have a key role in building one of the most popular gaming franchises in the history of computer games, SimCity. We are seeking people who are motivated, self-driven and have experience from a similar role in other games or software projects. Responsibilities: Work closely with product stakeholders to provide input on live product performance and feedback on product roadmap. Analyze and monitor game performance on a daily basis. Develop and test hypotheses to improve all game KPIs with A/B testing, in game promotions and sales. Turn data into learnings and make recommendations for the game team to continuously improve our games. Work closely with Analytics team to define and implement telemetry/tracking events, reporting and data visualization tools. Required skills: Strong analytics and problem-solving skills. Proactive and creative approach to always find the truth behind the numbers. Experience with data driven decision-making processes. Ability to work independently in ambiguous and fast-paced work environments. Strong team communicator with an ability to negotiate and unite subject experts to tackle complex problems. Excellent written and verbal communications in English, ability to effectively and systematically use data to support recommendations. A strong passion for games is a MUST. Great attention to detail and strong focus on the essential Great Excel + Powerpoint skills, experience working with SQL and R or statistical tools are an asset. A thirst for continuous learning and improving our understanding of how great games work. Required work & education: Bachelor’s degree in quantitative discipline preferred. For example: Business/Math/Statistics/Industrial Management/Finance/Computer Science degrees Direct experience working on live free-to-play games is preferred. Experience working with a related field like developing consumer facing Products", "company": ""}, {"job_title": "Technology Architecture Delivery Lead ", "date": "2018-10-01 10:02:14.0", "description": "Be yourself, Make a difference Make a difference your way Work where you re inspired to explore your passions, where your talents are nurtured and cultivated. Innovate with leading-edge technologies on some of the coolest projects you can imagine. And get the tools you need to keep learning and growing so you stay continually ahead of the game while making a difference in the world. Whatever you re passionate about, make the most of it in a career with Accenture. Whether you re a strategic thinker, a digital innovator, a tech wizard, or a business problem solver, you ll find an exciting career path on the cutting edge. We d love to get to know your unique blend of talents and help you explore and grow them further. We are in an exciting, unprecedented time in technology - with the pace of change and innovation continuing to accelerate. Technology and new business innovation is continuously transforming the way we work and live, raising many questions about both opportunities and challenges. In a time when most companies are still talking about moving to the cloud, our team is working on developing the next wave of applications specifically designed and optimized for the cloud. We re thinking ahead to the future to keep our clients relevant and to not just enhance the experience of their customers, but to take it to the next level. We re doing this by using rapid prototyping to leverage the power of the new and demonstrate the power and agility of the Cloud and leveraging Accenture assets and frameworks. Our team is comprised of not just hands on, technical individuals, but also thought leaders in this space. We overcome the technical obstacles holding our clients back so that they can move forward into the new, cloud native future. We are looking for people with: - 2-3 years hands on experience developing innovative applications. - Experience with at least one modern programming language (including but not limited to Go, JavaScript, Elixir, Ruby, Python, Rust, and sometimes Java) Experience explaining complex technical concepts to an executive audience. - Hands on experience with Amazon Web Services, Google Cloud Platform, or Azure; namely choosing platform components and assembling application and runtime architecture - Cloud Certification (Azure or AWS) - Experience leading an agile team. Below are nice to haves , and if you don t have more than one or two, don t be discouraged. We re trying to build a team with a very diverse set of skills and backgrounds, and a big part of that means different skills. - Experience with serverless frameworks and architectures. - Experience with containerizing legacy applications in the public cloud; native or 3rd party container solutions (e. g. Docker, Kubernetes, Docker EE, Mesosphere) - Experience with machine learning models and artificial intelligence (TensorFlow, Amazon SageMaker, Gluon, mxnet) - Experience with data transformations or data warehousing (AWS Redshift, AWS Glue, etc. ) - Experience with writing Infrastructure as Code for the public cloud (Terraform, Ansible, AWS CloudFormation, etc. ) - Experience with event driven architectures and constituent technologies (e. g. Kafka, Kinesis) and patterns (Event Sourcing, etc. ) Why Accenture? Because people enjoy working here; the work we do is challenging, interesting and meaningful. Our employees are our most important asset. At Accenture, we believe that quality comes from within and we invest heavily in developing your professional competencies. You will receive on-going training that builds and extends your skills on a continuous basis, allowing you to develop tailored expertise quickly. You will have direct access to state-of-the-art technologies, tools and developer kits from all the major hardware and software houses, keeping you on cutting-edge of your area of expertise. We offer the ability to balance professional challenges with your personal life. Professional development is a key part of the total reward package we offer, and you will qualify for competitive base compensation and performance based pay. If you are interested in giving back to the community, we do a lot of voluntary work at Accenture and you can be part of our internal Corporate Citizenship team. Join our future! Interested? Make your move - apply online and attach a CV, letter of application in English. We look forward to receiving your application! Accenture welcomes and encourages applications from diverse backgrounds related to gender, age, ethnicity, culture, race, religion and belief, disability, nationality, sexual orientation and gender identity. Inclusion and diversity are fundamental to our culture and core values, providing an environment where everyone brings distinct experience, talent and culture to their work. We invite you to be part of this diversity!", "company": ""}, {"job_title": "Technology Architecture Delivery Lead ", "date": "2018-11-21 10:12:16.0", "description": "Be yourself, Make a difference   Make a difference your way Work where you're inspired to explore your passions, where your talents are nurtured and cultivated. Innovate with leading-edge technologies on some of the coolest projects you can imagine. And get the tools you need to keep learning and growing so you stay continually ahead of the game while making a difference in the world.   Whatever you're passionate about, make the most of it in a career with Accenture. Whether you're a strategic thinker, a digital innovator, a tech wizard, or a business problem solver, you'll find an exciting career path on the cutting edge. We'd love to get to know your unique blend of talents and help you explore and grow them further.   We are in an exciting, unprecedented time in technology - with the pace of change and innovation continuing to accelerate. Technology and new business innovation is continuously transforming the way we work and live, raising many questions about both opportunities and challenges.  In a time when most companies are still talking about moving to the cloud, our team is working on developing the next wave of applications specifically designed and optimized for the cloud.  We're thinking ahead to the future to keep our clients relevant and to not just enhance the experience of their customers, but to take it to the next level. We're doing this by using rapid prototyping to leverage the power of the new and demonstrate the power and agility of the Cloud and leveraging Accenture assets and frameworks.   Our team is comprised of not just hands on, technical individuals, but also thought leaders in this space.  We overcome the technical obstacles holding our clients back so that they can move forward into the new, cloud native future.   We are looking for people with:   -             2-3 years hands on experience developing innovative applications. -             Experience with at least one modern programming language (including but not limited to Go, JavaScript, Elixir, Ruby, Python, Rust, and sometimes Java) Experience explaining complex technical concepts to an executive audience. -             Hands on experience with Amazon Web Services, Google Cloud Platform, or Azure; namely choosing platform components and assembling application and runtime architecture -             Cloud Certification (Azure or AWS) -             Experience leading an agile team. Below are 'nice to haves', and if you don't have more than one or two, don't be discouraged. We're trying to build a team with a very diverse set of skills and backgrounds, and a big part of that means different skills.   -             Experience with serverless frameworks and architectures. -             Experience with containerizing legacy applications in the public cloud; native or 3rd party container solutions (e.g. Docker, Kubernetes, Docker EE, Mesosphere) -             Experience with machine learning models and artificial intelligence (TensorFlow, Amazon SageMaker, Gluon, mxnet) -             Experience with data transformations or data warehousing (AWS Redshift, AWS Glue, etc.) -             Experience with writing Infrastructure as Code for the public cloud (Terraform, Ansible, AWS CloudFormation, etc.) -             Experience with event driven architectures and constituent technologies (e.g. Kafka, Kinesis) and patterns (Event Sourcing, etc.)   Why Accenture?   Because people enjoy working here; the work we do is challenging, interesting and meaningful. Our employees are our most important asset. At Accenture, we believe that quality comes from within and we invest heavily in developing your professional competencies.   You will receive on-going training that builds and extends your skills on a continuous basis, allowing you to develop tailored expertise quickly. You will have direct access to state-of-the-art technologies, tools and developer kits from all the major hardware and software houses, keeping you on cutting-edge of your area of expertise.   We offer the ability to balance professional challenges with your personal life. Professional development is a key part of the total reward package we offer, and you will qualify for competitive base compensation and performance based pay.   If you are interested in giving back to the community, we do a lot of voluntary work at Accenture and you can be part of our internal Corporate Citizenship team.   Join our future!     Interested? Make your move - apply online and attach a CV, letter of application in English. We look forward to receiving your application!       Accenture welcomes and encourages applications from diverse backgrounds related to gender, age, ethnicity, culture, race, religion and belief, disability, nationality, sexual orientation and gender identity. Inclusion and diversity are fundamental to our culture and core values, providing an environment where everyone brings distinct experience, talent and culture to their work. We invite you to be part of this diversity!  ", "company": ""}, {"job_title": "Technology Architecture Delivery Lead ", "date": "2018-11-14 14:30:07.0", "description": "Be yourself, Make a difference   Make a difference your way Work where you re inspired to explore your passions, where your talents are nurtured and cultivated. Innovate with leading-edge technologies on some of the coolest projects you can imagine. And get the tools you need to keep learning and growing so you stay continually ahead of the game while making a difference in the world.   Whatever you re passionate about, make the most of it in a career with Accenture. Whether you re a strategic thinker, a digital innovator, a tech wizard, or a business problem solver, you ll find an exciting career path on the cutting edge. We d love to get to know your unique blend of talents and help you explore and grow them further.   We are in an exciting, unprecedented time in technology - with the pace of change and innovation continuing to accelerate. Technology and new business innovation is continuously transforming the way we work and live, raising many questions about both opportunities and challenges.   In a time when most companies are still talking about moving to the cloud, our team is working on developing the next wave of applications specifically designed and optimized for the cloud.   We re thinking ahead to the future to keep our clients relevant and to not just enhance the experience of their customers, but to take it to the next level. We re doing this by using rapid prototyping to leverage the power of the new and demonstrate the power and agility of the Cloud and leveraging Accenture assets and frameworks.   Our team is comprised of not just hands on, technical individuals, but also thought leaders in this space.   We overcome the technical obstacles holding our clients back so that they can move forward into the new, cloud native future.   We are looking for people with:   -             2-3 years hands on experience developing innovative applications. -             Experience with at least one modern programming language (including but not limited to Go, JavaScript, Elixir, Ruby, Python, Rust, and sometimes Java) Experience explaining complex technical concepts to an executive audience. -             Hands on experience with Amazon Web Services, Google Cloud Platform, or Azure; namely choosing platform components and assembling application and runtime architecture -             Cloud Certification (Azure or AWS) -             Experience leading an agile team. Below are nice to haves , and if you don t have more than one or two, don t be discouraged. We re trying to build a team with a very diverse set of skills and backgrounds, and a big part of that means different skills.   -             Experience with serverless frameworks and architectures. -             Experience with containerizing legacy applications in the public cloud; native or 3rd party container solutions (e. g. Docker, Kubernetes, Docker EE, Mesosphere) -             Experience with machine learning models and artificial intelligence (TensorFlow, Amazon SageMaker, Gluon, mxnet) -             Experience with data transformations or data warehousing (AWS Redshift, AWS Glue, etc. ) -             Experience with writing Infrastructure as Code for the public cloud (Terraform, Ansible, AWS CloudFormation, etc. ) -             Experience with event driven architectures and constituent technologies (e. g. Kafka, Kinesis) and patterns (Event Sourcing, etc. )   Why Accenture?   Because people enjoy working here; the work we do is challenging, interesting and meaningful. Our employees are our most important asset. At Accenture, we believe that quality comes from within and we invest heavily in developing your professional competencies.   You will receive on-going training that builds and extends your skills on a continuous basis, allowing you to develop tailored expertise quickly. You will have direct access to state-of-the-art technologies, tools and developer kits from all the major hardware and software houses, keeping you on cutting-edge of your area of expertise.   We offer the ability to balance professional challenges with your personal life. Professional development is a key part of the total reward package we offer, and you will qualify for competitive base compensation and performance based pay.   If you are interested in giving back to the community, we do a lot of voluntary work at Accenture and you can be part of our internal Corporate Citizenship team.   Join our future!     Interested? Make your move - apply online and attach a CV, letter of application in English. We look forward to receiving your application!       Accenture welcomes and encourages applications from diverse backgrounds related to gender, age, ethnicity, culture, race, religion and belief, disability, nationality, sexual orientation and gender identity. Inclusion and diversity are fundamental to our culture and core values, providing an environment where everyone brings distinct experience, talent and culture to their work. We invite you to be part of this diversity!  ", "company": ""}, {"job_title": "Unity 3D Developer ", "date": "2019-03-23 14:30:05.0", "description": "Unity 3D Developer, Helsinki We in Fleetonomy are creating a human machine cooperation platform to get people in loop to remotely help autonomous vehicles both land and air to achieve their full potential with the current technology. We work with partners and in projects that can literally change the World as we know it and our ordinary day is still science fiction to most. And now we are looking for more game developers willing to take a plunge into robotics and to join us. As an experienced Software Developer on our team, you will be a creative problem solver who enjoys developing tools, improving and extending workflows. You will work with our engineering team and customers to design and build tools and pipelines for the platform. We ll count on you to raise the bar with solid engineering fundamentals and leadership, but also with your passion for making great software. Basic Qualifications: Degree in Computer Science or a related field, or equivalent experience Advanced software engineering skills, including the ability to write expert-level, maintainable, and robust code in C# and Python Good communication skills and ability to work effectively on shared projects Strong computer science fundamentals in game algorithms Unity3D, Physics, 3D maths and procedural content generation Strong 3D math skills alongside with ability to model polygons Passionate about new technologies Flexible and willing to learn and utilise wide array of tools, operating systems and technologies in a daily basis Driver s license Get things done attitude Residence (permit) within European Union Nice to have: Machine learning, image recognition, AR / VR / MR C/C++, ROS, Java Physics based game / simulation development background, preferably RTS Network programming (TCP/IP, UDP, async systems) Experience with drones Fleetonomy. ai is a start-up located at the heart of Helsinki. We offer small and passionate team of colleagues who share your interest in drones. Our platform leverages a killer combo of artificial intelligence (AI), advanced algorithms, and machine learning. We partner with world-class organizations to develop our technology and you ll work with them and have the opportunity to learn a lot. Does this sound interesting? If you say yes, please submit your CV with a short motivation letter to johanna. lintunen@barona. fi by April 8th, 2019. Edellytykset työnsaannille: C#, Python, Unity3d Apply latest by 08. 04. 2019 on our site. Or for more information please contact: johanna. lintunen@barona. fi , +358 50 591 9340 Rekrytointia hoitaa Barona", "company": ""}, {"job_title": "Unity 3D Developer ", "date": "2019-03-23 14:30:05.0", "description": "Unity 3D Developer, Helsinki We in Fleetonomy are creating a human machine cooperation platform to get people in loop to remotely help autonomous vehicles both land and air to achieve their full potential with the current technology. We work with partners and in projects that can literally change the World as we know it and our ordinary day is still science fiction to most. And now we are looking for more game developers willing to take a plunge into robotics and to join us. As an experienced Software Developer on our team, you will be a creative problem solver who enjoys developing tools, improving and extending workflows. You will work with our engineering team and customers to design and build tools and pipelines for the platform. We ll count on you to raise the bar with solid engineering fundamentals and leadership, but also with your passion for making great software. Basic Qualifications: Degree in Computer Science or a related field, or equivalent experience Advanced software engineering skills, including the ability to write expert-level, maintainable, and robust code in C# and Python Good communication skills and ability to work effectively on shared projects Strong computer science fundamentals in game algorithms Unity3D, Physics, 3D maths and procedural content generation Strong 3D math skills alongside with ability to model polygons Passionate about new technologies Flexible and willing to learn and utilise wide array of tools, operating systems and technologies in a daily basis Driver s license Get things done attitude Residence (permit) within European Union Nice to have: Machine learning, image recognition, AR / VR / MR C/C++, ROS, Java Physics based game / simulation development background, preferably RTS Network programming (TCP/IP, UDP, async systems) Experience with drones Fleetonomy. ai is a start-up located at the heart of Helsinki. We offer small and passionate team of colleagues who share your interest in drones. Our platform leverages a killer combo of artificial intelligence (AI), advanced algorithms, and machine learning. We partner with world-class organizations to develop our technology and you ll work with them and have the opportunity to learn a lot. Does this sound interesting? If you say yes, please submit your CV with a short motivation letter to johanna. lintunen@barona. fi by April 8th, 2019. Edellytykset työnsaannille: C#, Python, Unity3d Apply latest by 08. 04. 2019 on our site. Or for more information please contact: johanna. lintunen@barona. fi , +358 50 591 9340 Rekrytointia hoitaa Barona", "company": ""}, {"job_title": "Accounting Summer Trainee ", "date": "2018-02-27 19:04:07.0", "description": "Accounting Summer Trainee, aTalent Recruiting, Helsinki, muu osa-aikatyö, 4 days per week, Kesto: 3 - 6 kk, Until mid-September 2018Type: Part-time summer job Preferred background: 2+ year student Working time and duration: 4 days per week, until mid-September 2018Preferred starting date: Mid-May 2018Location: Ruoholahti, HelsinkiApplication deadline: March 8th, 2018Supercell is a mobile game developer based in the mobile gaming capital of the world, Helsinki, with offices in San Francisco, Tokyo, Seoul and Shanghai - a. . . <keywords>Helsinki, Asiantuntijat, </keywords>", "company": "aTalent Recruiting"}, {"job_title": "Accounting Summer Trainee ", "date": "2018-02-27 19:04:07.0", "description": "Accounting Summer Trainee, aTalent Recruiting, Helsinki, muu osa-aikatyö, 4 days per week, Kesto: 3 - 6 kk, Until mid-September 2018Type: Part-time summer job Preferred background: 2+ year student Working time and duration: 4 days per week, until mid-September 2018Preferred starting date: Mid-May 2018Location: Ruoholahti, HelsinkiApplication deadline: March 8th, 2018Supercell is a mobile game developer based in the mobile gaming capital of the world, Helsinki, with offices in San Francisco, Tokyo, Seoul and Shanghai - a. . . <keywords>Helsinki, Asiantuntijat, </keywords>", "company": "aTalent Recruiting"}, {"job_title": "Admin Summer Trainee ", "date": "2018-03-02 20:22:25.0", "description": "Admin Summer Trainee, aTalent Recruiting, Helsinki, Haku päättyy: 23. 03. 2018, kokoaikatyö, 37, 5 hours per week until early September 2018, Kesto: 3 - 6 kkType: Full-time summer job Preferred background: 2nd to 4th year studentWorking time and duration: 37, 5 hours per week until early September 2018Preferred starting date: Early May 2018Location: Ruoholahti, HelsinkiApplication deadline: March 8th, 2018Supercell is a mobile game developer based in the mobile gaming capital of the world, Helsinki, with offices in San Francisco, Tokyo, Seoul an. . . <keywords>Helsinki, Asiantuntijat, </keywords>", "company": "aTalent Recruiting"}, {"job_title": "Admin Summer Trainee ", "date": "2018-03-02 20:22:25.0", "description": "Admin Summer Trainee, aTalent Recruiting, Helsinki, Haku päättyy: 23. 03. 2018, kokoaikatyö, 37, 5 hours per week until early September 2018, Kesto: 3 - 6 kkType: Full-time summer job Preferred background: 2nd to 4th year studentWorking time and duration: 37, 5 hours per week until early September 2018Preferred starting date: Early May 2018Location: Ruoholahti, HelsinkiApplication deadline: March 8th, 2018Supercell is a mobile game developer based in the mobile gaming capital of the world, Helsinki, with offices in San Francisco, Tokyo, Seoul an. . . <keywords>Helsinki, Asiantuntijat, </keywords>", "company": "aTalent Recruiting"}, {"job_title": "AWS Architects ", "date": "2018-10-10 11:50:18.0", "description": "Be yourself, Make a difference Make a difference your way Work where you re inspired to explore your passions, where your talents are nurtured and cultivated. Innovate with leading-edge technologies on some of the coolest projects you can imagine. And get the tools you need to keep learning and growing so you stay continually ahead of the game while making a difference in the world. Whatever you re passionate about, make the most of it in a career with Accenture. Whether you re a strategic thinker, a digital innovator, a tech wizard, or a business problem solver, you ll find an exciting career path on the cutting edge. We d love to get to know your unique blend of talents and help you explore and grow them further. Do you want to work with Amazon Web Services architecture in new and large-scale customer engagements? Are you able to define a AWS  Cloud Native production environment and DevOps chain? Are you following and passionate about the new services launched by AWS and even more interested to see them in action, at real projects? If you re looking for new challenges in your technical career, then the possibility to work in a vibrant environment with access to world class training and expertise might be something for you. We are currently looking for AWS Architects to our Helsinki office. Applicants should have 2 to 10 years of experience with defining and implementing Technical Architecture. In addition, candidates should have theoretical and hands-on experience of AWS services on IaaS and PaaS levels. Working as a consultant within Accenture Technology you will develop both functional and technical expertise, you will also help to deliver world class solutions that help our clients to become - and remain - high performing businesses. Professional development and training curriculums with Accenture gives you access to new technology and next generation methodologies. This includes Agile, DevOps, Test Management and much more. You will also be given the opportunity to adapt newly acquired skills to your professional development goals, present the value of new tools, methods and technologies to your client and break traditional and outdated patters for systems and technology implementation. Depending on your experience level your role as a consultant will include: Design and implement innovative, scalable, and secure technical solutions with high availability with the help of the AWS service catalogue Assessing and recommending the best of breed AWS technology solutions to address client needs Create business cases for technical and organizational transformation to, and introduction of, AWS based deliveries Evaluate and recommend E2E solutions based on AWS services or hybrid solutions Define solution architecture, develop estimates and plans. Act as a Subject Matter Expert within AWS and be a mentor for junior colleagues. We are looking for candidates with high levels of motivation and that also meet the following criteria: Master s Degree or the professional equivalent within Engineering or Computer Science Broad technical background Deep, hands-on design and development background in AWS, across a wide range of AWS services Fluent in Finnish and English Strong interest in developing within technology and personal leadership One or several of the below certifications > Certified AWS Solutions Architect - Professional > Certified AWS Solutions Architect - Associate > Certified DevOps Engineer - Professional > Certified Developer - Associate Why Accenture? Because people enjoy working here; the work we do is challenging, interesting and meaningful. Our employees are our most important asset. At Accenture, we believe that quality comes from within and we invest heavily in developing your professional competencies. You will receive on-going training that builds and extends your skills on a continuous basis, allowing you to develop tailored expertise quickly. You will have direct access to state-of-the-art technologies, tools and developer kits from all the major hardware and software houses, keeping you on cutting-edge of your area of expertise. We offer the ability to balance professional challenges with your personal life. Professional development is a key part of the total reward package we offer, and you will qualify for competitive base compensation and performance based pay. If you are interested in giving back to the community, we do a lot of voluntary work at Accenture and you can be part of our internal Corporate Citizenship team. Interested? Make your move - apply online and attach a CV and letter of application in English. We look forward to receiving your application! If you have any questions concerning or our recruitment process, please contact finland. recruitment@accenture. com Accenture welcomes and encourages applications from diverse backgrounds related to gender, age, ethnicity, culture, race, religion and belief, disability, nationality, sexual orientation and gender identity. Inclusion and diversity are fundamental to our culture and core values, providing an environment where everyone brings distinct experience, talent and culture to their work. We invite you to be part of this diversity.", "company": ""}, {"job_title": "Backend Developer ", "date": "2019-04-05 14:30:07.0", "description": "Do you possess good skills in Python and Linux? In this position, it is your skills and attitude that matter - not your educational background or work experience! We are now looking for Junior Backend Developer to Aiven Oy which was chosen as one of the most promising Finnish startups in 2018 by Talouselämä magazine! Go ahead and apply already today! Kuvaus Academic Work is looking for a Backend Developer to our client company Aiven Oy. You will be recruited to our client company. Academic Work will take care of the recruitment process, therefore candidates are kindly asked to aim all questions to Academic Work at hel03@academicwork. fi Työtehtävät We are looking for an enthusiastic Backend Developer to join Aivens committed and talented team! You have a keen interest in software development and good understanding of Linux. If you are in the end of your studies, it is also possible to work part-time initially. Aivens philosophy is to automate everything in order to avoid repetitive manual work. Backend systems are mostly written in Python as well as some Go, C, and Java. Aiven currently offers seven different open-source database services, including PostgreSQL, Apache Kafka, Elasticsearch, Apache Cassandra and Redis. The company has functional but light development processes with the focus on thorough pull request reviews. You will be working with highly-skilled and experienced team of just over 20 people so youll have excellent possibilities to develop and learn more! Aiven also offers very good benefits to its employees. Etsimämme henkilö on In this position, your background doesnt play a strong role - what matters is your skills! We expect you to have good skills in Python and Linux. You might have gained your skills through your own projects, studies or work experience. We value good coding practices and people who are capable of receiving and giving feedback. In addition, you communicate fluently in English. Please send your application along with a link to your Github profile. Apply for this position if you have: • Good development skills in Python • Good Linux skills • Fluent verbal and written English skills It is seen as an advantage if you have experience with SQL and/or NoSQL databases and/or good understanding of IT security. Studies in IT field are also seen as a plus. Start: According to agreement Working hours: Full-time (or part-time in the beginning) Employment period: Permanent Location: Helsinki Salary: According to agreement Published: 05. 03. 2019 INFORMATION ON THE APPLICATION PROCESS To apply for the job click on Apply here below. Remember to attach your CV into your application! We only handle applications through our website but if you have questions about the position you can reach us via email in hel03@academicwork. fi Please write the advert ID in the subject and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please notice that the advert can be removed before eventual last dates on our external advertising pages. When the advert is being removed its either due to that the processes is finished or because we have many qualified applications and are continuing in the selection/interview phase. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi When employed at Academic Work you will have your own dedicated Consultant Manager, whose role is to answer your questions, support your career development and ensure you enjoy your place of work. Infoa asiakkaasta Aiven hosts and manages open-source database and messaging systems for business clients around the world on all major cloud platforms. Aivens mission is to allow developers to focus on building awesome applications without worrying about data infrastructure management. They accomplish this by providing services that are usable, reliable, relevant and secure at competitive price points. Aiven is fast-paced and growth focused company with an exceedingly high ambition level. They are striving to break through as the worlds leading open-source DBaaS vendor. People at Aiven are self-motivated, highly competent and talented. They are building a team in which all of your colleagues are extraordinary at what they do and exemplify the Aiven values and culture. Speaking of culture, Aivens culture is no-bullshit, professional and determined, with an aim of keeping the customers happy. Processes are kept light and to-the-point, focusing on things that are truly important like security and quality. At Aiven, people take work seriously but that doesnt rule out fun. Bad jokes are heard everywhere and they have company celebrations and informal board game evenings. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15023078", "company": "Aiven Oy"}, {"job_title": "Backend Developer ", "date": "2019-04-05 14:30:07.0", "description": "Do you possess good skills in Python and Linux? In this position, it is your skills and attitude that matter - not your educational background or work experience! We are now looking for Junior Backend Developer to Aiven Oy which was chosen as one of the most promising Finnish startups in 2018 by Talouselämä magazine! Go ahead and apply already today! Kuvaus Academic Work is looking for a Backend Developer to our client company Aiven Oy. You will be recruited to our client company. Academic Work will take care of the recruitment process, therefore candidates are kindly asked to aim all questions to Academic Work at hel03@academicwork. fi Työtehtävät We are looking for an enthusiastic Backend Developer to join Aivens committed and talented team! You have a keen interest in software development and good understanding of Linux. If you are in the end of your studies, it is also possible to work part-time initially. Aivens philosophy is to automate everything in order to avoid repetitive manual work. Backend systems are mostly written in Python as well as some Go, C, and Java. Aiven currently offers seven different open-source database services, including PostgreSQL, Apache Kafka, Elasticsearch, Apache Cassandra and Redis. The company has functional but light development processes with the focus on thorough pull request reviews. You will be working with highly-skilled and experienced team of just over 20 people so youll have excellent possibilities to develop and learn more! Aiven also offers very good benefits to its employees. Etsimämme henkilö on In this position, your background doesnt play a strong role - what matters is your skills! We expect you to have good skills in Python and Linux. You might have gained your skills through your own projects, studies or work experience. We value good coding practices and people who are capable of receiving and giving feedback. In addition, you communicate fluently in English. Please send your application along with a link to your Github profile. Apply for this position if you have: • Good development skills in Python • Good Linux skills • Fluent verbal and written English skills It is seen as an advantage if you have experience with SQL and/or NoSQL databases and/or good understanding of IT security. Studies in IT field are also seen as a plus. Start: According to agreement Working hours: Full-time (or part-time in the beginning) Employment period: Permanent Location: Helsinki Salary: According to agreement Published: 05. 03. 2019 INFORMATION ON THE APPLICATION PROCESS To apply for the job click on Apply here below. Remember to attach your CV into your application! We only handle applications through our website but if you have questions about the position you can reach us via email in hel03@academicwork. fi Please write the advert ID in the subject and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please notice that the advert can be removed before eventual last dates on our external advertising pages. When the advert is being removed its either due to that the processes is finished or because we have many qualified applications and are continuing in the selection/interview phase. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi When employed at Academic Work you will have your own dedicated Consultant Manager, whose role is to answer your questions, support your career development and ensure you enjoy your place of work. Infoa asiakkaasta Aiven hosts and manages open-source database and messaging systems for business clients around the world on all major cloud platforms. Aivens mission is to allow developers to focus on building awesome applications without worrying about data infrastructure management. They accomplish this by providing services that are usable, reliable, relevant and secure at competitive price points. Aiven is fast-paced and growth focused company with an exceedingly high ambition level. They are striving to break through as the worlds leading open-source DBaaS vendor. People at Aiven are self-motivated, highly competent and talented. They are building a team in which all of your colleagues are extraordinary at what they do and exemplify the Aiven values and culture. Speaking of culture, Aivens culture is no-bullshit, professional and determined, with an aim of keeping the customers happy. Processes are kept light and to-the-point, focusing on things that are truly important like security and quality. At Aiven, people take work seriously but that doesnt rule out fun. Bad jokes are heard everywhere and they have company celebrations and informal board game evenings. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15023078", "company": "Aiven Oy"}, {"job_title": "Backend Developer ", "date": "2019-03-05 14:30:06.0", "description": "Do you possess good skills in Python and Linux? In this position, it is your skills and attitude that matter - not your educational background or work experience! We are now looking for Junior Backend Developer to Aiven Oy which was chosen as one the most promising Finnish startups in 2018 by Talouselämä magazine! Go ahead and apply already today! Kuvaus Academic Work is looking for a Backend Developer to our client company Aiven Oy. You will be recruited to our client company. Academic Work will take care of the recruitment process, therefore candidates are kindly asked to aim all questions to Academic Work at hel03@academicwork. fi Työtehtävät We are looking for an enthusiastic Backend Developer to join Aivens committed and talented team! You have a keen interest in software development and good understanding of Linux. If you are in the end of your studies, it is also possible to work part-time initially. Aivens philosophy is to automate everything in order to avoid repetitive manual work. Backend systems are mostly written in Python as well as some Go, C, and Java. Aiven currently offers seven different open-source database services, including PostgreSQL, Apache Kafka, Elasticsearch, Apache Cassandra and Redis. The company has functional but light development processes with the focus on thorough pull request reviews. You will be working with highly-skilled and experienced team of just over 20 people so youll have excellent possibilities to develop and learn more! Aiven also offers very good benefits to its employees. Etsimämme henkilö on In this position, your background doesnt play a strong role - what matters is your skills! We expect you to have good skills in Python and Linux. You might have gained your skills through your own projects, studies or work experience. We value good coding practices and people who are capable of receiving and giving feedback. In addition, you communicate fluently in English. Please send your application along with a link to your Github profile. Apply for this position if you have: • Good development skills in Python • Good Linux skills • Fluent verbal and written English skills It is seen as an advantage if you have experience with SQL and/or NoSQL databases and/or good understanding of IT security. Studies in IT field are also seen as a plus. Start: According to agreement Working hours: Full-time (or part-time in the beginning) Employment period: Permanent Location: Helsinki Salary: According to agreement Published: 05. 03. 2019 INFORMATION ON THE APPLICATION PROCESS To apply for the job click on Apply here below. Remember to attach your CV into your application! We only handle applications through our website but if you have questions about the position you can reach us via email in hel03@academicwork. fi Please write the advert ID in the subject and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please notice that the advert can be removed before eventual last dates on our external advertising pages. When the advert is being removed its either due to that the processes is finished or because we have many qualified applications and are continuing in the selection/interview phase. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi When employed at Academic Work you will have your own dedicated Consultant Manager, whose role is to answer your questions, support your career development and ensure you enjoy your place of work. Infoa asiakkaasta Aiven hosts and manages open-source database and messaging systems for business clients around the world on all major cloud platforms. Aivens mission is to allow developers to focus on building awesome applications without worrying about data infrastructure management. They accomplish this by providing services that are usable, reliable, relevant and secure at competitive price points. Aiven is fast-paced and growth focused company with an exceedingly high ambition level. They are striving to break through as the worlds leading open-source DBaaS vendor. People at Aiven are self-motivated, highly competent and talented. They are building a team in which all of your colleagues are extraordinary at what they do and exemplify the Aiven values and culture. Speaking of culture, Aivens culture is no-bullshit, professional and determined, with an aim of keeping the customers happy. Processes are kept light and to-the-point, focusing on things that are truly important like security and quality. At Aiven, people take work seriously but that doesnt rule out fun. Bad jokes are heard everywhere and they have company celebrations and informal board game evenings. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15023078", "company": "Aiven Oy"}, {"job_title": "Backend Developer ", "date": "2019-03-05 14:30:06.0", "description": "Do you possess good skills in Python and Linux? In this position, it is your skills and attitude that matter - not your educational background or work experience! We are now looking for Junior Backend Developer to Aiven Oy which was chosen as one the most promising Finnish startups in 2018 by Talouselämä magazine! Go ahead and apply already today! Kuvaus Academic Work is looking for a Backend Developer to our client company Aiven Oy. You will be recruited to our client company. Academic Work will take care of the recruitment process, therefore candidates are kindly asked to aim all questions to Academic Work at hel03@academicwork. fi Työtehtävät We are looking for an enthusiastic Backend Developer to join Aivens committed and talented team! You have a keen interest in software development and good understanding of Linux. If you are in the end of your studies, it is also possible to work part-time initially. Aivens philosophy is to automate everything in order to avoid repetitive manual work. Backend systems are mostly written in Python as well as some Go, C, and Java. Aiven currently offers seven different open-source database services, including PostgreSQL, Apache Kafka, Elasticsearch, Apache Cassandra and Redis. The company has functional but light development processes with the focus on thorough pull request reviews. You will be working with highly-skilled and experienced team of just over 20 people so youll have excellent possibilities to develop and learn more! Aiven also offers very good benefits to its employees. Etsimämme henkilö on In this position, your background doesnt play a strong role - what matters is your skills! We expect you to have good skills in Python and Linux. You might have gained your skills through your own projects, studies or work experience. We value good coding practices and people who are capable of receiving and giving feedback. In addition, you communicate fluently in English. Please send your application along with a link to your Github profile. Apply for this position if you have: • Good development skills in Python • Good Linux skills • Fluent verbal and written English skills It is seen as an advantage if you have experience with SQL and/or NoSQL databases and/or good understanding of IT security. Studies in IT field are also seen as a plus. Start: According to agreement Working hours: Full-time (or part-time in the beginning) Employment period: Permanent Location: Helsinki Salary: According to agreement Published: 05. 03. 2019 INFORMATION ON THE APPLICATION PROCESS To apply for the job click on Apply here below. Remember to attach your CV into your application! We only handle applications through our website but if you have questions about the position you can reach us via email in hel03@academicwork. fi Please write the advert ID in the subject and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please notice that the advert can be removed before eventual last dates on our external advertising pages. When the advert is being removed its either due to that the processes is finished or because we have many qualified applications and are continuing in the selection/interview phase. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi When employed at Academic Work you will have your own dedicated Consultant Manager, whose role is to answer your questions, support your career development and ensure you enjoy your place of work. Infoa asiakkaasta Aiven hosts and manages open-source database and messaging systems for business clients around the world on all major cloud platforms. Aivens mission is to allow developers to focus on building awesome applications without worrying about data infrastructure management. They accomplish this by providing services that are usable, reliable, relevant and secure at competitive price points. Aiven is fast-paced and growth focused company with an exceedingly high ambition level. They are striving to break through as the worlds leading open-source DBaaS vendor. People at Aiven are self-motivated, highly competent and talented. They are building a team in which all of your colleagues are extraordinary at what they do and exemplify the Aiven values and culture. Speaking of culture, Aivens culture is no-bullshit, professional and determined, with an aim of keeping the customers happy. Processes are kept light and to-the-point, focusing on things that are truly important like security and quality. At Aiven, people take work seriously but that doesnt rule out fun. Bad jokes are heard everywhere and they have company celebrations and informal board game evenings. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15023078", "company": "Aiven Oy"}, {"job_title": "Backend Developer ", "date": "2018-09-26 15:44:15.0", "description": "Backend Developer, Playmore Games Oy, Helsinki, Haku päättyy: 15. 10. 2018, kokoaikatyö, Kesto: yli 12 kuukauttaAre you a passionate developer who enjoys responsibility and playing a vital role in creating something truly unique?You are the right match if you value freedom, responsibility, and achievement in your work, you re not afraid of an immense challenge, hard work, or getting your hands dirty. You seek to build something completely new while planning and designing things far into the future while w. . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Playmore Games Oy"}, {"job_title": "Backend Developer ", "date": "2018-09-26 15:44:15.0", "description": "Backend Developer, Playmore Games Oy, Helsinki, Haku päättyy: 15. 10. 2018, kokoaikatyö, Kesto: yli 12 kuukauttaAre you a passionate developer who enjoys responsibility and playing a vital role in creating something truly unique?You are the right match if you value freedom, responsibility, and achievement in your work, you re not afraid of an immense challenge, hard work, or getting your hands dirty. You seek to build something completely new while planning and designing things far into the future while w. . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Playmore Games Oy"}, {"job_title": "Backend Developer ", "date": "2019-03-22 15:24:18.0", "description": "Backend Developer, Playmore Games Oy, Helsinki. Backend Developer, Playmore Games Oy, Helsinki , Haku päättyy: 20. 04. 2019, kokoaikatyö, Kesto: yli 12 kuukautta Are you a passionate developer who enjoys responsibility and playing a vital role in creating something truly unique?You are the right match if you value freedom, responsibility, and achievement in your work, you re not afraid of an immense challenge, hard work, or getting your hands dirty. You seek to build something completely new while planning and designing things far into the future while. . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Playmore Games Oy"}, {"job_title": "Backend Developer ", "date": "2019-03-22 15:24:18.0", "description": "Backend Developer, Playmore Games Oy, Helsinki. Backend Developer, Playmore Games Oy, Helsinki , Haku päättyy: 20. 04. 2019, kokoaikatyö, Kesto: yli 12 kuukautta Are you a passionate developer who enjoys responsibility and playing a vital role in creating something truly unique?You are the right match if you value freedom, responsibility, and achievement in your work, you re not afraid of an immense challenge, hard work, or getting your hands dirty. You seek to build something completely new while planning and designing things far into the future while. . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Playmore Games Oy"}, {"job_title": "Content Specialist ", "date": "2019-02-13 14:30:05.0", "description": "Content Specialist Hi, My name is Hale Okkonen and I ve made a commitment to make marketing one of Posti s gamechangers. This means we need to rethink marketing and crystallize Posti s brand. From the content perspective, this means lots of new stories to tell. We will be redesigning Posti s core messages because It s not only about traditional Postal services any more, instead we have the leave the old nostalgia behind and start telling the story about one of the most modern networks in the world. Currently I m looking for a content specialist who will create customer-relevant, brand-resonating content that resonates also with our target audiences whether they be in b2b or b2c segments. The person who I m looking for is a curious lifelong learner who can build interesting content from scratch by using different source materials such as research studies (in Posti we have plenty), interviews, articles etc. even from B2B business areas you probably don t have experience in yet. The content you will be creating are for websites, social sites, blogs, newsletters, white papers, infographics, product reviews and testimonials. You also understand the different criteria for inbound and outbound content as well the criteria for marketing funnel stages such as reach, engage, activate, nurture. For this role I m looking for a great writer who also understands the fundamentals of lead generation and sales processes. If you are a true sanaseppo that can turn complex product information to customer centric and interesting stories, tweets, posts and blogs, then you are the one I m looking for. The job will also include identifying relevant topics, fact-checking, and analyzing sources to generate information. In your CV we will be looking for: Several years of experience in writing and editing content for different platforms, channels, publications etc. Ability to coordinate work of stakeholders (designers, interviewees, photographs etc. ) Ability to maintain tone of voice of different brands in different contexts Strong written & verbal communication skills Background in journalism and/or content marketing are highly appreciated. Native Finnish language skills (bot written and written) English language skills (both written and spoken). Native skills are highly appreciated. Academic degree in relevant area. By joining our team you will be part of Finland s biggest digital transformation, you will be a builder of the future and a key player to enable the future growth and business development. You will get to cooperate with our top professionals in marketing, brand, communications, sales, digital commerce & development. You will work with a highly agile, positive and supporting team of experienced professionals, driving Posti s business transformation. You ll have a chance to learn and develop and you get to work with inspiring and challenging projects in dynamic and open environment & culture. You will have a true chance to impact our business by driving our marketing development and strategies and you get to define how we rethink the future of marketing at Posti. We will provide you comprehensive introduction to your role and coaching and training for your future development. We offer you competitive salary, modern working facilities and tools, and the benefits like, mobile phone, sports & culture benefit, gym, personnel discounts, team events and activities. The position is located in our modern office in Ilmala, Helsinki. For further information, you can call any time (well not during the night). If I m busy, leave me a sms so that I know to give you a call back as soon I m available. I ll also will be answering all the mails and LinkedIn messages as well. Your contact is important so do not hesitate to contact me. My contact information is tel. +358505274009 email. hale. okkonen@posti. com Please apply as soon as possible but 28th February at www. posti. com/careers, as the positions will be filled immediately when the best marketing people have been found. Hope to hear from you soon! BR Hale Okkonen Marketing Director Posti Oy Posti is the leading postal and logistics service company in Finland. Our core business include postal services, parcels, freight and logistics services. We have the widest network coverage in Finland and we visit about three million households and companies every weekday. We manage the flow of everyday life in 11 countries. Our net sales in 2017 amounted to EUR 1, 647 million and the number of our personnel is approximately 20, 000. We are a smoke-free workplace. www. posti. com", "company": ""}, {"job_title": "Content Specialist ", "date": "2019-02-13 14:30:05.0", "description": "Content Specialist Hi, My name is Hale Okkonen and I ve made a commitment to make marketing one of Posti s gamechangers. This means we need to rethink marketing and crystallize Posti s brand. From the content perspective, this means lots of new stories to tell. We will be redesigning Posti s core messages because It s not only about traditional Postal services any more, instead we have the leave the old nostalgia behind and start telling the story about one of the most modern networks in the world. Currently I m looking for a content specialist who will create customer-relevant, brand-resonating content that resonates also with our target audiences whether they be in b2b or b2c segments. The person who I m looking for is a curious lifelong learner who can build interesting content from scratch by using different source materials such as research studies (in Posti we have plenty), interviews, articles etc. even from B2B business areas you probably don t have experience in yet. The content you will be creating are for websites, social sites, blogs, newsletters, white papers, infographics, product reviews and testimonials. You also understand the different criteria for inbound and outbound content as well the criteria for marketing funnel stages such as reach, engage, activate, nurture. For this role I m looking for a great writer who also understands the fundamentals of lead generation and sales processes. If you are a true sanaseppo that can turn complex product information to customer centric and interesting stories, tweets, posts and blogs, then you are the one I m looking for. The job will also include identifying relevant topics, fact-checking, and analyzing sources to generate information. In your CV we will be looking for: Several years of experience in writing and editing content for different platforms, channels, publications etc. Ability to coordinate work of stakeholders (designers, interviewees, photographs etc. ) Ability to maintain tone of voice of different brands in different contexts Strong written & verbal communication skills Background in journalism and/or content marketing are highly appreciated. Native Finnish language skills (bot written and written) English language skills (both written and spoken). Native skills are highly appreciated. Academic degree in relevant area. By joining our team you will be part of Finland s biggest digital transformation, you will be a builder of the future and a key player to enable the future growth and business development. You will get to cooperate with our top professionals in marketing, brand, communications, sales, digital commerce & development. You will work with a highly agile, positive and supporting team of experienced professionals, driving Posti s business transformation. You ll have a chance to learn and develop and you get to work with inspiring and challenging projects in dynamic and open environment & culture. You will have a true chance to impact our business by driving our marketing development and strategies and you get to define how we rethink the future of marketing at Posti. We will provide you comprehensive introduction to your role and coaching and training for your future development. We offer you competitive salary, modern working facilities and tools, and the benefits like, mobile phone, sports & culture benefit, gym, personnel discounts, team events and activities. The position is located in our modern office in Ilmala, Helsinki. For further information, you can call any time (well not during the night). If I m busy, leave me a sms so that I know to give you a call back as soon I m available. I ll also will be answering all the mails and LinkedIn messages as well. Your contact is important so do not hesitate to contact me. My contact information is tel. +358505274009 email. hale. okkonen@posti. com Please apply as soon as possible but 28th February at www. posti. com/careers, as the positions will be filled immediately when the best marketing people have been found. Hope to hear from you soon! BR Hale Okkonen Marketing Director Posti Oy Posti is the leading postal and logistics service company in Finland. Our core business include postal services, parcels, freight and logistics services. We have the widest network coverage in Finland and we visit about three million households and companies every weekday. We manage the flow of everyday life in 11 countries. Our net sales in 2017 amounted to EUR 1, 647 million and the number of our personnel is approximately 20, 000. We are a smoke-free workplace. www. posti. com", "company": ""}, {"job_title": "Game Security Engineer ", "date": "2018-11-21 10:12:16.0", "description": "Working time: Full-time  Length: Permanent  Location: Ruoholahti, Helsinki  Requested starting date: As soon as possible, negotiable DL for applications: 2.12.2018 For over 25 years, Epic Games has been making award-winning games and game engine technology that empowers others to make visually stunning games and 3D content that brings environments to life like never before. Epic’s award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design. As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent. Epic Games Finland provides live services to over 80 online multiplayer PC games in collaboration with over 43 game studios. Their suite of Gamer Services in Game Security, Game Telemetry and Game Community target the live management of player engagement, and empower developers and publishers to make the right decisions in their games 24/7, with ease. Our services build upon the existing infrastructure that already serves over 100 million users and gives us unmatched ability to provide state of the art tools for the PC gaming industry. Epic Games Helsinki is now looking for a Game Security Engineer to join our growing team and work with not only our own titles but a wide variety of games from around the world. You’ll write code in an extremely unique and fast-paced environment to counteract cheats while minimizing invasiveness. You’ll need to have an independent ability to write high quality code and strong communication skills for working with teams within and outside Epic. To be successful in this role you need to have the ability to thrive in chaos and enjoy working with the team toward a common goal. Responsibilities: Apply deep knowledge of operating system internals to detect and prevent the latest cheating techniques Reverse engineer cheats and other malicious software Actively seek out the next opportunity to make an improvement Communicate regularly with game developers to meet their unique needs Build a strong overall understanding of our game security systems Work closely with anti-cheat data analysts to quickly iterate on new techniques Qualifications: 3+ years of experience with C++ in a professional environment Knowledge of C++11 and newer standards Background in reverse engineering malware is a plus Experience exploring game cheats is also a plus General familiarity with databases and message broker systems would be helpful Experience with Unreal Engine is considered a plus What Epic Games offers: Epic Games Finland offers an opportunity to work in one of the premier game studios in the world. The work is challenging with great opportunities to learn and apply your skills . You’ll get the chance to become part of industry groups and collaborate with the great minds with many of our varying partner organizations in the gaming industry. You’ll also get to work internationally with trips to conferences. At Epic we give you the freedom to do your work when and how you like, as long as is done well. We have relaxed and flexible working environment at our awesome office space in Ruoholahti. We also provide an excellent insurance coverage with private health and dental care. Sounds good? If you’re the person we’re looking for, send by latest December 2nd your CV, application and relevant samples (Github link etc.) of your projects here:  https://apply.atalent.fi/epic-games-finland-game-security-engineer-11-2018 You can read more about Epic Games Finland https://www.kamu.gg/acquisition/ If you have questions about the application process, please contact Recruitment Manager Mia Paatsalo (mia.paatsalo[at]atalent.fi +358 50 468 0610). This is going to be Epic!", "company": ""}, {"job_title": "Senior Frontend Engineer ( Game Services ) ", "date": "2018-11-14 14:30:07.0", "description": "Working time: Full-time  Length: Permanent  Location: Ruoholahti, Helsinki  Requested starting date: As soon as possible, negotiable DL for applications: 2. 12. 2018 For over 25 years, Epic Games has been making award-winning games and game engine technology that empowers others to make visually stunning games and 3D content that brings environments to life like never before. Epic’s award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, but it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design.  As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent. Epic Games Finland provides live services to over 80 online multiplayer PC games in collaboration with over 43 game studios. Their suite of Gamer Services in Game Security, Game Telemetry and Game Community target the live management of player engagement, and empower developers and publishers to make the right decisions in their games 24/7, with ease. Our services build upon the existing infrastructure that already serves over 100 million users and gives us unmatched ability to provide state of the art tools for the PC gaming industry. Epic Games is adding a Senior Frontend Engineer to work across the stack with a focus on Epic’s customer-facing portals. You’ll work with the Epic team based to develop and maintain responsive front-end and user-centered experiences. The core of the frontend stack is based on React, but we are constantly adopting new technologies and practices if we find them useful. Responsibilities: Develop new features and maintain the existing codebase Cooperate with backend engineers to expand API endpoints (or implement them yourself) Identify emerging complexity, and offer solutions to simplify code design Deliver great user experiences to the world’s leading game studios Performance improvement and security hardening of web applications Provide input for production/live release control process Communicate technical risks across the teams Qualifications: Deep knowledge of JavaScript and React library Experience with the design, execution, and deployment of large React applications Experience with state machines and/or RxJS Understanding of functional programming principles and their role in React applications Experience with using a statically typed language or one of the many typing systems for JavaScript Commitment to writing maintainable and understandable code Experience with unit testing React applications Willingness to learn from and teach fellow teammates What Epic Games offers: Epic Games Finland offers an opportunity to work in one of the premier game studios in the world. The work is challenging with great opportunities to learn and apply your skills. You’ll get the chance to become part of industry groups and collaborate with the great minds with many of our varying partner organizations in the gaming industry.  You’ll also get to work internationally with trips to conferences. At Epic we give you the freedom to do your work when and how you like, as long as it is done well. We have a relaxed and flexible working environment at our awesome office space in Ruoholahti. We also provide an excellent insurance coverage with private health and dental care. Sounds good? If you’re the person we’re looking for, send your CV, application and relevant samples (Github link etc. ) of your projects here:   https: //apply. atalent. fi/epic-games-finland-senior-frontend-engineer-game-services-11-2018   by December 2nd the latest. You can read more about Epic Games Finland here:  https: //www. kamu. gg/acquisition/. If you have questions about the application process, please contact Recruitment Manager Mia Paatsalo (mia. paatsalo[at]atalent. fi +358 50 468 0610). This is going to be Epic!   ", "company": ""}, {"job_title": "Senior Frontend Engineer ( Game Services ) ", "date": "2018-11-14 14:30:07.0", "description": "Working time: Full-time  Length: Permanent  Location: Ruoholahti, Helsinki  Requested starting date: As soon as possible, negotiable DL for applications: 2. 12. 2018 For over 25 years, Epic Games has been making award-winning games and game engine technology that empowers others to make visually stunning games and 3D content that brings environments to life like never before. Epic’s award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, but it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design.  As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent. Epic Games Finland provides live services to over 80 online multiplayer PC games in collaboration with over 43 game studios. Their suite of Gamer Services in Game Security, Game Telemetry and Game Community target the live management of player engagement, and empower developers and publishers to make the right decisions in their games 24/7, with ease. Our services build upon the existing infrastructure that already serves over 100 million users and gives us unmatched ability to provide state of the art tools for the PC gaming industry. Epic Games is adding a Senior Frontend Engineer to work across the stack with a focus on Epic’s customer-facing portals. You’ll work with the Epic team based to develop and maintain responsive front-end and user-centered experiences. The core of the frontend stack is based on React, but we are constantly adopting new technologies and practices if we find them useful. Responsibilities: Develop new features and maintain the existing codebase Cooperate with backend engineers to expand API endpoints (or implement them yourself) Identify emerging complexity, and offer solutions to simplify code design Deliver great user experiences to the world’s leading game studios Performance improvement and security hardening of web applications Provide input for production/live release control process Communicate technical risks across the teams Qualifications: Deep knowledge of JavaScript and React library Experience with the design, execution, and deployment of large React applications Experience with state machines and/or RxJS Understanding of functional programming principles and their role in React applications Experience with using a statically typed language or one of the many typing systems for JavaScript Commitment to writing maintainable and understandable code Experience with unit testing React applications Willingness to learn from and teach fellow teammates What Epic Games offers: Epic Games Finland offers an opportunity to work in one of the premier game studios in the world. The work is challenging with great opportunities to learn and apply your skills. You’ll get the chance to become part of industry groups and collaborate with the great minds with many of our varying partner organizations in the gaming industry.  You’ll also get to work internationally with trips to conferences. At Epic we give you the freedom to do your work when and how you like, as long as it is done well. We have a relaxed and flexible working environment at our awesome office space in Ruoholahti. We also provide an excellent insurance coverage with private health and dental care. Sounds good? If you’re the person we’re looking for, send your CV, application and relevant samples (Github link etc. ) of your projects here:   https: //apply. atalent. fi/epic-games-finland-senior-frontend-engineer-game-services-11-2018   by December 2nd the latest. You can read more about Epic Games Finland here:  https: //www. kamu. gg/acquisition/. If you have questions about the application process, please contact Recruitment Manager Mia Paatsalo (mia. paatsalo[at]atalent. fi +358 50 468 0610). This is going to be Epic!   ", "company": ""}, {"job_title": "Senior Backend Engineer ( Java ) - Game Services ", "date": "2018-11-09 14:30:06.0", "description": "Working time: Fulltime  Length: Permanent  Location: Ruoholahti, Helsinki  Requested starting date: As soon as possible, negotiable DL for applications: 18. 11. 2018 For over 25 years, Epic Games has been making award-winning games and game engine technology that empowers others to make visually stunning games and 3D content that brings environments to life like never before. Epic’s award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design.   As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent   Epic Games Finland provides live services to over 80 online multiplayer PC games in collaboration with over 43 game studios. Their suite of Gamer Services in Game Security, Game Telemetry and Game Community target the live management of player engagement and empower developers and publishers to make the right decisions in their games 24/7, with ease. Our services build upon the existing infrastructure that already serves over 100 million users and gives us unmatched ability to provide state of the art tools for the PC gaming industry. As a Senior Backend Engineer you’ll be at the center of game services that power player experiences for all products around the globe. From design, implementation, and deployment you’ll be able to shape the services and features that drive the future of our products. We are looking for an experienced Engineer to work on highly scalable backend with the passion for innovative technology and competitive games. Responsibilities: Ensure the utilization of latest technology to build high performance, high availability backend services and web applications Performance improvement and security hardening of backend services and infrastructure Design, implement, and iterate on scalable, secure, highly-available, backend services Provide input into the product road map, including milestone schedules and deliverables Follow industry trends and maintain a strong interest in cutting edge technology Handle live operational issues on services and platform Maintain excellent code quality Qualifications: Strong knowledge of Java, and its ecosystem, such as framework, build tools, and performance measurement 5+ years building online backend systems – developing network, data-processing pipelines, integration tools, web API backend Experiencing designing resilient systems with monitoring/troubleshooting capabilities Experience with Unix flavored O/S Experience in a CI tools, and Docker-related technologies Passion for building and maintaining consumer-facing backend applications that are secure, scalable, highly available and performant Experience with database and storage systems – PostgreSQL, MongoDB, Redis, Hbase, and Cassandra Experience with cloud technologies, preferably AWS Experience with concurrency and network programming What Epic Games offers: Epic Games Finland offers an opportunity to work in one of the premier game studios in the world. The work is challenging with great opportunities to learn and apply your skills and you’ll get the chance to become part of industry groups and collaborate with the great minds with many of our varying partner organizations in the gaming industry.   You’ll also get to work internationally with trips to conferences. At Epic we give you the freedom to do your work when and how you like, as long as it is done well. We have relaxed and flexible working environment at our awesome office space in Ruoholahti.   We also provide an excellent insurance coverage with private health and dental care. Sounds good? If you’re the person we’re looking for, send your CV, application and relevant samples (Github link etc. ) of your projects here:   https: //apply. atalent. fi/epic-games-finland-senior-backend-engineer-java-11-2018  by November 18th. You can read more about Epic Games Finland https: //www. kamu. gg/acquisition/. If you have questions about the application process, please contact Recruitment Manager Mia Paatsalo (mia. paatsalo[at]atalent. fi +358 50 468 0610). This is going to be Epic!", "company": ""}, {"job_title": "Senior Backend Engineer ( Java ) - Game Services ", "date": "2018-11-09 14:30:06.0", "description": "Working time: Fulltime  Length: Permanent  Location: Ruoholahti, Helsinki  Requested starting date: As soon as possible, negotiable DL for applications: 18. 11. 2018 For over 25 years, Epic Games has been making award-winning games and game engine technology that empowers others to make visually stunning games and 3D content that brings environments to life like never before. Epic’s award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design.   As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent   Epic Games Finland provides live services to over 80 online multiplayer PC games in collaboration with over 43 game studios. Their suite of Gamer Services in Game Security, Game Telemetry and Game Community target the live management of player engagement and empower developers and publishers to make the right decisions in their games 24/7, with ease. Our services build upon the existing infrastructure that already serves over 100 million users and gives us unmatched ability to provide state of the art tools for the PC gaming industry. As a Senior Backend Engineer you’ll be at the center of game services that power player experiences for all products around the globe. From design, implementation, and deployment you’ll be able to shape the services and features that drive the future of our products. We are looking for an experienced Engineer to work on highly scalable backend with the passion for innovative technology and competitive games. Responsibilities: Ensure the utilization of latest technology to build high performance, high availability backend services and web applications Performance improvement and security hardening of backend services and infrastructure Design, implement, and iterate on scalable, secure, highly-available, backend services Provide input into the product road map, including milestone schedules and deliverables Follow industry trends and maintain a strong interest in cutting edge technology Handle live operational issues on services and platform Maintain excellent code quality Qualifications: Strong knowledge of Java, and its ecosystem, such as framework, build tools, and performance measurement 5+ years building online backend systems – developing network, data-processing pipelines, integration tools, web API backend Experiencing designing resilient systems with monitoring/troubleshooting capabilities Experience with Unix flavored O/S Experience in a CI tools, and Docker-related technologies Passion for building and maintaining consumer-facing backend applications that are secure, scalable, highly available and performant Experience with database and storage systems – PostgreSQL, MongoDB, Redis, Hbase, and Cassandra Experience with cloud technologies, preferably AWS Experience with concurrency and network programming What Epic Games offers: Epic Games Finland offers an opportunity to work in one of the premier game studios in the world. The work is challenging with great opportunities to learn and apply your skills and you’ll get the chance to become part of industry groups and collaborate with the great minds with many of our varying partner organizations in the gaming industry.   You’ll also get to work internationally with trips to conferences. At Epic we give you the freedom to do your work when and how you like, as long as it is done well. We have relaxed and flexible working environment at our awesome office space in Ruoholahti.   We also provide an excellent insurance coverage with private health and dental care. Sounds good? If you’re the person we’re looking for, send your CV, application and relevant samples (Github link etc. ) of your projects here:   https: //apply. atalent. fi/epic-games-finland-senior-backend-engineer-java-11-2018  by November 18th. You can read more about Epic Games Finland https: //www. kamu. gg/acquisition/. If you have questions about the application process, please contact Recruitment Manager Mia Paatsalo (mia. paatsalo[at]atalent. fi +358 50 468 0610). This is going to be Epic!", "company": ""}, {"job_title": "Senior Big Data Engineer - Game Services ", "date": "2018-11-09 14:30:06.0", "description": "Working time: Fulltime  Length: Permanent  Location: Ruoholahti, Helsinki  Requested starting date: As soon as possible, negotiable DL for applications: 18. 11. 2018 For over 25 years, Epic Games has been making award-winning games and game engine technology that empowers others to make visually stunning games and 3D content that brings environments to life like never before. Epic’s award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design.   As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent. Epic Games Finland provides live services to over 80 online multiplayer PC games in collaboration with over 43 game studios. Their suite of Gamer Services in Game Security, Game Telemetry and Game Community target the live management of player engagement and empower developers and publishers to make the right decisions in their games 24/7, with ease. Our services build upon the existing infrastructure that already serves over 100 million users and gives us unmatched ability to provide state of the art tools for the PC gaming industry. As a Senior Big Data Engineer at Epic you’ll be at the data processing core that power our game services around the globe. From design, implementation, and deployment you’ll be able to shape the services and features that drive the future of our products. Epic Games is looking for an experienced Engineer to work with highly scalable data processing backend as well as a passion for innovative technology and competitive games. Responsibilities: Ensure the utilization of latest technology to build highly scalable backend services to extract, transform and load enormous amount of data Design, implement, and iterate on scalable, high performance, highly-available backend services Collaborate and support machine learning scientists across product and services teams to explore hidden knowledge from data lake Provide input into the product road map, including milestone schedules and deliverables Follow industry trends and maintain a strong interest in cutting edge technology Handle live operational issues on services and platform Maintain excellent code quality Qualifications: Strong knowledge of Java, and its ecosystem, such as framework, build tools, and performance measurement 5+ years building online backend systems – developing network, data-processing pipelines, integration tools, API backend Experience with big data technologies, such as Kafka, Hadoop, Spark, etc Experiencing designing resilient systems with monitoring/troubleshooting capabilities Experience with Unix flavored O/S Experience in a CI tools, and Docker-related technologies Passion for building and maintaining backend applications that process real-time unstructured data and process large Experience with database and storage systems – PostgreSQL, MongoDB, Hbase, Cassandra, and HDFS Experience with cloud technologies, preferably AWS What Epic Games offers: Epic Games Finland offers an opportunity to work in one of the premier game studios in the world. The work is challenging with great opportunities to learn and apply your skills and you’ll get the chance to become part of industry groups and collaborate with the great minds with many of our varying partner organizations in the gaming industry.   You’ll also get to work internationally with trips to conferences. At Epic we give you the freedom to do your work when and how you like, as long as it is done well. We have relaxed and flexible working environment at our awesome office space in Ruoholahti.   We also provide an excellent insurance coverage with private health and dental care. Sounds good? If you’re the person we’re looking for, send your CV, application and relevant samples (Github link etc. ) of your projects here: https: //apply. atalent. fi/epic-games-finland-senior-big-data-engineer-11-2018  by November 18th. You can read more about Epic Games Finland https: //www. kamu. gg/acquisition/. If you have questions about the application process, please contact Recruitment Manager Mia Paatsalo (mia. paatsalo[at]atalent. fi +358 50 468 0610). This is going to be Epic!", "company": ""}, {"job_title": "Senior Big Data Engineer - Game Services ", "date": "2018-11-09 14:30:06.0", "description": "Working time: Fulltime  Length: Permanent  Location: Ruoholahti, Helsinki  Requested starting date: As soon as possible, negotiable DL for applications: 18. 11. 2018 For over 25 years, Epic Games has been making award-winning games and game engine technology that empowers others to make visually stunning games and 3D content that brings environments to life like never before. Epic’s award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design.   As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent. Epic Games Finland provides live services to over 80 online multiplayer PC games in collaboration with over 43 game studios. Their suite of Gamer Services in Game Security, Game Telemetry and Game Community target the live management of player engagement and empower developers and publishers to make the right decisions in their games 24/7, with ease. Our services build upon the existing infrastructure that already serves over 100 million users and gives us unmatched ability to provide state of the art tools for the PC gaming industry. As a Senior Big Data Engineer at Epic you’ll be at the data processing core that power our game services around the globe. From design, implementation, and deployment you’ll be able to shape the services and features that drive the future of our products. Epic Games is looking for an experienced Engineer to work with highly scalable data processing backend as well as a passion for innovative technology and competitive games. Responsibilities: Ensure the utilization of latest technology to build highly scalable backend services to extract, transform and load enormous amount of data Design, implement, and iterate on scalable, high performance, highly-available backend services Collaborate and support machine learning scientists across product and services teams to explore hidden knowledge from data lake Provide input into the product road map, including milestone schedules and deliverables Follow industry trends and maintain a strong interest in cutting edge technology Handle live operational issues on services and platform Maintain excellent code quality Qualifications: Strong knowledge of Java, and its ecosystem, such as framework, build tools, and performance measurement 5+ years building online backend systems – developing network, data-processing pipelines, integration tools, API backend Experience with big data technologies, such as Kafka, Hadoop, Spark, etc Experiencing designing resilient systems with monitoring/troubleshooting capabilities Experience with Unix flavored O/S Experience in a CI tools, and Docker-related technologies Passion for building and maintaining backend applications that process real-time unstructured data and process large Experience with database and storage systems – PostgreSQL, MongoDB, Hbase, Cassandra, and HDFS Experience with cloud technologies, preferably AWS What Epic Games offers: Epic Games Finland offers an opportunity to work in one of the premier game studios in the world. The work is challenging with great opportunities to learn and apply your skills and you’ll get the chance to become part of industry groups and collaborate with the great minds with many of our varying partner organizations in the gaming industry.   You’ll also get to work internationally with trips to conferences. At Epic we give you the freedom to do your work when and how you like, as long as it is done well. We have relaxed and flexible working environment at our awesome office space in Ruoholahti.   We also provide an excellent insurance coverage with private health and dental care. Sounds good? If you’re the person we’re looking for, send your CV, application and relevant samples (Github link etc. ) of your projects here: https: //apply. atalent. fi/epic-games-finland-senior-big-data-engineer-11-2018  by November 18th. You can read more about Epic Games Finland https: //www. kamu. gg/acquisition/. If you have questions about the application process, please contact Recruitment Manager Mia Paatsalo (mia. paatsalo[at]atalent. fi +358 50 468 0610). This is going to be Epic!", "company": ""}, {"job_title": "Full Stack / Senior Software Developer ", "date": "2018-11-26 14:31:01.0", "description": "Full Stack / Senior Software Developer, SDN, Elisa Oyj, Helsinki, Haku päättyy: 09.12.2018 klo 23:59, kokoaikatyö, Kesto: yli 12 kuukauttaTired of the legacy stuff? This is your (almost) unique opportunity to work on building new stuff on automating backbone networks. Come and join us! We?re shooting the big guns and playing the hard games.Hello there! We are Elisa EDN team and our team is part of the great Elisa Software Services unit. We like to think that we are a bunch of agile and enthusiastic fellas but come meet us and see ...<keywords>Helsinki,Erityisasiantuntijat,</keywords>", "company": "Elisa Oyj"}, {"job_title": "Full Stack Developer ", "date": "2019-03-06 14:30:06.0", "description": "We are looking for a Full Stack Developer for our client company Shark Punch Oy, to work with the development of their Matchmade platform. If you have good skills in Java Script, experience through your work or own projects, and also are eager to develop your skills, you might be the person we are looking for! Keep on reading and apply already today! Kuvaus Academic Work is looking for A Fullstack Developer for our client Shark Punch Oy. You will be recruited to our client company. Academic Work will take care of the recruitment process, therefore candidates are kindly asked to direct all questions to Academic Work esp03@academicwork. fi Työtehtävät In this position, you will be working as a part of the platform team, and your main task is to develop the Matchmade platform. You will be working together with the team leader, four full stack developers and one designer. The work is divided into periods of four weeks, when the whole team works together. Your will get a lot of help and support from your team, and the progress of your work will be evaluated in a weekly follow-up. This position suits you, if you want to be a part of a fascinating startup company! Etsimämme henkilö on You are the one were looking for if you have a relevant educational background, almost 2 years of relevant work experience or have gained experience through your own projects. Knowledge in Java Script is required in this position. You have good communication and teamwork skills, and are eager to learn new things and to develop your skills even more. You also communicate fluently in English. Apply for this position if you have: • Relevant educational background, almost 2 years of relevant work experience or experience through your own projects • Good skills in Java Script • Good communication and teamwork skills • Eagerness to learn and develop your skills • Fluent spoken and written English It is also seen as an advantage if you have: • Used React (frontend) • Worked with a project using Node (backend) or used the Express Library • Used SQL • Other language skills Go ahead and apply already today, since we fill the position as soon as we find a suitable candidate! Remember also to link your Github profile to the application if you have one. • Start: As soon as possible • Working hours: Full-time • Employment period: Permanent • Location: Helsinki • Salary: According to agreement • Published: 6. 3. 2019 To apply for the job you need to register on our website and then click on Apply here. Remember to attach your CV into your application! We only process applications through our website but if you have questions about the position you can reach us via email in esp03 @academicwork. fi/. Please write the advert ID in the subject field and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please note that the advert can be removed prior to the last application dates on our external advertising pages. In the event the advert has been removed it is either due to the process being completed or because we have a sufficient number of qualified applications and are proceeding to the selection/interview phase in the process. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi Infoa asiakkaasta Matchmade is the smart way to work with influencers. Our algorithm matches your game with the best and most relevant influencers, so you can reach your ideal target audience. Were a small and experienced team shaping the future of the fastest growing new media out there. We come from diverse backgrounds from all over the world, and we treat each other like adults, but arent too serious about it. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15023221", "company": "Shark Punch "}, {"job_title": "Full Stack Developer ", "date": "2019-03-06 14:30:06.0", "description": "We are looking for a Full Stack Developer for our client company Shark Punch Oy, to work with the development of their Matchmade platform. If you have good skills in Java Script, experience through your work or own projects, and also are eager to develop your skills, you might be the person we are looking for! Keep on reading and apply already today! Kuvaus Academic Work is looking for A Fullstack Developer for our client Shark Punch Oy. You will be recruited to our client company. Academic Work will take care of the recruitment process, therefore candidates are kindly asked to direct all questions to Academic Work esp03@academicwork. fi Työtehtävät In this position, you will be working as a part of the platform team, and your main task is to develop the Matchmade platform. You will be working together with the team leader, four full stack developers and one designer. The work is divided into periods of four weeks, when the whole team works together. Your will get a lot of help and support from your team, and the progress of your work will be evaluated in a weekly follow-up. This position suits you, if you want to be a part of a fascinating startup company! Etsimämme henkilö on You are the one were looking for if you have a relevant educational background, almost 2 years of relevant work experience or have gained experience through your own projects. Knowledge in Java Script is required in this position. You have good communication and teamwork skills, and are eager to learn new things and to develop your skills even more. You also communicate fluently in English. Apply for this position if you have: • Relevant educational background, almost 2 years of relevant work experience or experience through your own projects • Good skills in Java Script • Good communication and teamwork skills • Eagerness to learn and develop your skills • Fluent spoken and written English It is also seen as an advantage if you have: • Used React (frontend) • Worked with a project using Node (backend) or used the Express Library • Used SQL • Other language skills Go ahead and apply already today, since we fill the position as soon as we find a suitable candidate! Remember also to link your Github profile to the application if you have one. • Start: As soon as possible • Working hours: Full-time • Employment period: Permanent • Location: Helsinki • Salary: According to agreement • Published: 6. 3. 2019 To apply for the job you need to register on our website and then click on Apply here. Remember to attach your CV into your application! We only process applications through our website but if you have questions about the position you can reach us via email in esp03 @academicwork. fi/. Please write the advert ID in the subject field and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please note that the advert can be removed prior to the last application dates on our external advertising pages. In the event the advert has been removed it is either due to the process being completed or because we have a sufficient number of qualified applications and are proceeding to the selection/interview phase in the process. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi Infoa asiakkaasta Matchmade is the smart way to work with influencers. Our algorithm matches your game with the best and most relevant influencers, so you can reach your ideal target audience. Were a small and experienced team shaping the future of the fastest growing new media out there. We come from diverse backgrounds from all over the world, and we treat each other like adults, but arent too serious about it. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15023221", "company": "Shark Punch "}, {"job_title": "Full Stack Developer ", "date": "2018-10-04 14:21:06.0", "description": "Working with 3D printing, augmented reality and virtual reality sounds interesting? Do you see yourself working in the pioneering educational tech startup in Finland? Do you recognize yourself as a passionate, motivated Full Stack Developer with a high work morale? Become part of an amazing success story and hop in to the middle of an ambitious phase as 3DBear is rapidly growing and going international. 3DBear values their culture of working hard, while having fun at work take part and apply immediately, since the position will be filled as soon as we find the right person. Kuvaus Academic Work is looking for a Full Stack Developer to our client 3DBear Oy. This job is a staffing position, which means that you will be employed by Academic Work and work as a consultant at 3DBear Oy. Työtehtävät You will work on developing and maintaining a web service that supports 3DBears application their customers use. We re looking for a generalist developer who will be working with any part of the tech stack, from bouncing product design UX ideas with customers to configuring same database migrations in a CI flow. You re well versed in basics of modern web development: HTML, CSS, JS, and always looking to learn new ones. You work well in a constantly evolving startup environment and can manage uncertainties and prioritize work. • UX Design • Front-end development • Database migrations and back-end development In addition, this position includes an opportunity to grow into a team lead position in the future, mentoring junior developers. Keywords: HTML, CSS, JS, React, Redux, C#, . NET Core, Entity Framework, SQL, Unity, Azure, Git, Kanban, Lean development Etsimämme henkilö on Our ideal candidate has already some experience working around production codebases and IT projects in general. This isn t your first gig, and you ve worked around production codebases previously. If you work fluently in all parts of the web development stack and you have the passion to learn new skills throughout your career you are what we want. Apply for this position if you have: • Good working knowledge of all parts of the web development stack • Enthusiasm to learn new skills • Previous experience in building web apps • Solid skills in C# • Excellent skills in English • Minimum of 1-2 years of working experience Previous work experience of similar tasks is beneficial. Former experience of Unity, Azure and understanding of Client/Server architecture is seen as a big advantage. In addition to experience, we value technological curiousness and interest in continuous learning of new technologies. Please, provide us your GitHub-account/portfolio in your application. Start: As soon as possible Working hours: Full-time Employment period: 12 months, possibility to be recruited Location: Helsinki, Startup Maria Salary: As per agreement Published: 03. 10. 2018 In this position you will be employed by Academic Work and we take care of all the legal responsibilities of an employer such as salary payments, insurances and health care. It is important for us that you feel well and perform in your job. Your consultant manager will be in regular contact with you during the assignment and guides you on your career. Academic Work is an authorized staffing and recruitment agency and our employees are extremely satisfied, something that we are very proud of. We are here to help you succeed! INFORMATION ON THE APPLICATION PROCESS To apply for the job click on Apply here below. Remember to attach your CV into your application! We only handle applications through our website but if you have questions about the position you can reach us via email in esp03@academicwork. fi Please write the advert ID in the subject and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please notice that the advert can be removed before eventual last dates on our external advertising pages. When the advert is being removed its either due to that the processes is finished or because we have many qualified applications and are continuing in the selection/interview phase. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi When employed at Academic Work you will have your own dedicated Consultant Manager, whose role is to answer your questions, support your career development and ensure you enjoy your place of work. Infoa asiakkaasta 3DBear Oy is the pioneering educational technology startup in Finland. They develop learning solutions that utilize 3D printing, augmented reality and virtual reality. Their mission is to help educators create an environment in which students can learn life-skills that will make them successful in the 21st century to elicit collaboration, improve multidisciplinary skills, develop a growth mindset and creative problem solving. They provide schools and educational institutions with relevant contemporary content and game-like software that make learning engaging and fun. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15014376", "company": "the pioneering educational tech startup 3DBear "}, {"job_title": "Full Stack Developer ", "date": "2018-10-04 14:21:06.0", "description": "Working with 3D printing, augmented reality and virtual reality sounds interesting? Do you see yourself working in the pioneering educational tech startup in Finland? Do you recognize yourself as a passionate, motivated Full Stack Developer with a high work morale? Become part of an amazing success story and hop in to the middle of an ambitious phase as 3DBear is rapidly growing and going international. 3DBear values their culture of working hard, while having fun at work take part and apply immediately, since the position will be filled as soon as we find the right person. Kuvaus Academic Work is looking for a Full Stack Developer to our client 3DBear Oy. This job is a staffing position, which means that you will be employed by Academic Work and work as a consultant at 3DBear Oy. Työtehtävät You will work on developing and maintaining a web service that supports 3DBears application their customers use. We re looking for a generalist developer who will be working with any part of the tech stack, from bouncing product design UX ideas with customers to configuring same database migrations in a CI flow. You re well versed in basics of modern web development: HTML, CSS, JS, and always looking to learn new ones. You work well in a constantly evolving startup environment and can manage uncertainties and prioritize work. • UX Design • Front-end development • Database migrations and back-end development In addition, this position includes an opportunity to grow into a team lead position in the future, mentoring junior developers. Keywords: HTML, CSS, JS, React, Redux, C#, . NET Core, Entity Framework, SQL, Unity, Azure, Git, Kanban, Lean development Etsimämme henkilö on Our ideal candidate has already some experience working around production codebases and IT projects in general. This isn t your first gig, and you ve worked around production codebases previously. If you work fluently in all parts of the web development stack and you have the passion to learn new skills throughout your career you are what we want. Apply for this position if you have: • Good working knowledge of all parts of the web development stack • Enthusiasm to learn new skills • Previous experience in building web apps • Solid skills in C# • Excellent skills in English • Minimum of 1-2 years of working experience Previous work experience of similar tasks is beneficial. Former experience of Unity, Azure and understanding of Client/Server architecture is seen as a big advantage. In addition to experience, we value technological curiousness and interest in continuous learning of new technologies. Please, provide us your GitHub-account/portfolio in your application. Start: As soon as possible Working hours: Full-time Employment period: 12 months, possibility to be recruited Location: Helsinki, Startup Maria Salary: As per agreement Published: 03. 10. 2018 In this position you will be employed by Academic Work and we take care of all the legal responsibilities of an employer such as salary payments, insurances and health care. It is important for us that you feel well and perform in your job. Your consultant manager will be in regular contact with you during the assignment and guides you on your career. Academic Work is an authorized staffing and recruitment agency and our employees are extremely satisfied, something that we are very proud of. We are here to help you succeed! INFORMATION ON THE APPLICATION PROCESS To apply for the job click on Apply here below. Remember to attach your CV into your application! We only handle applications through our website but if you have questions about the position you can reach us via email in esp03@academicwork. fi Please write the advert ID in the subject and paste the advert link in the mail. We are continuously screening and contacting candidates so make sure to send your application as soon as possible. Please notice that the advert can be removed before eventual last dates on our external advertising pages. When the advert is being removed its either due to that the processes is finished or because we have many qualified applications and are continuing in the selection/interview phase. We are the Home of the Young Professionals. We are experts in recruitment and staffing university students, recently graduated and professionals in the beginning of their career. You can be employed by us as a consultant in one of our client companies or be recruited directly to our client via our recruitment co-operation. You can read more about us at www. academicwork. fi When employed at Academic Work you will have your own dedicated Consultant Manager, whose role is to answer your questions, support your career development and ensure you enjoy your place of work. Infoa asiakkaasta 3DBear Oy is the pioneering educational technology startup in Finland. They develop learning solutions that utilize 3D printing, augmented reality and virtual reality. Their mission is to help educators create an environment in which students can learn life-skills that will make them successful in the 21st century to elicit collaboration, improve multidisciplinary skills, develop a growth mindset and creative problem solving. They provide schools and educational institutions with relevant contemporary content and game-like software that make learning engaging and fun. Kysyttävää? info@academicwork. fi, Ilmoitusnumero: 15014376", "company": "the pioneering educational tech startup 3DBear "}, {"job_title": "Full-stack Developer ", "date": "2018-01-19 20:07:38.0", "description": "Full-stack Developer, Barona IT Oy, Helsinki, kokoaikatyö, Kesto: yli 12 kuukauttaWant to help us in making Sanakirja. fi the No. 1 dictionary & vocabulary learning service in Finland? This is your chance: we re looking for a (Senior) Full-stack Developer to join our amazing team! In this role, you will be responsible of the development of our Sanakirja. fi back-ends as well as of our e-learning games backend and gamification. Role-Maintaining and developing Sanakirja. fi back-. . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Barona IT Oy"}, {"job_title": "Full-stack Developer ", "date": "2018-01-19 20:07:38.0", "description": "Full-stack Developer, Barona IT Oy, Helsinki, kokoaikatyö, Kesto: yli 12 kuukauttaWant to help us in making Sanakirja. fi the No. 1 dictionary & vocabulary learning service in Finland? This is your chance: we re looking for a (Senior) Full-stack Developer to join our amazing team! In this role, you will be responsible of the development of our Sanakirja. fi back-ends as well as of our e-learning games backend and gamification. Role-Maintaining and developing Sanakirja. fi back-. . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Barona IT Oy"}, {"job_title": "Games Programmer ", "date": "2019-04-23 18:57:26.0", "description": "Games Programmer, AILiveSim, Helsinki. Games Programmer, AILiveSim, Helsinki , Haku päättyy: 29. 05. 2019 klo 18: 00, kokoaikatyö, flexible, Kesto: yli 12 kuukautta, or as per agreed AILiveSim is a young startup, that uses game technology to create realistic dynamic simulation for training and testing AI algorithms. Our software can be used to augment datasets, collect associated ground truth, train new learning algorithms using curriculum, or various types of testing. We create environments that look realistic, are parametric and we model some procedural elements to allow for. . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": ""}, {"job_title": "Games Programmer ", "date": "2019-04-23 18:57:26.0", "description": "Games Programmer, AILiveSim, Helsinki. Games Programmer, AILiveSim, Helsinki , Haku päättyy: 29. 05. 2019 klo 18: 00, kokoaikatyö, flexible, Kesto: yli 12 kuukautta, or as per agreed AILiveSim is a young startup, that uses game technology to create realistic dynamic simulation for training and testing AI algorithms. Our software can be used to augment datasets, collect associated ground truth, train new learning algorithms using curriculum, or various types of testing. We create environments that look realistic, are parametric and we model some procedural elements to allow for. . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": ""}, {"job_title": "HTML5 Game Programmer ", "date": "2019-01-23 18:17:51.0", "description": "HTML5 Game Programmer, Barona Oy, Barona IT Oy, Helsinki. HTML5 Game Programmer, Barona Oy, Helsinki , Haku päättyy: 12. 02. 2019 klo 23: 59, kokoaikatyö, Kesto: yli 12 kuukautta Paf Game Studio is looking for a Game Programmer with passion to games. You are self-motivated, goal-oriented and a strong team player. You can visualize how things should work, and how to translate this into a functioning solution. You take pride in your work and know what it means to take responsibility and deliver quality focused products. Come to work in a team of professionals that drives th. . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Barona Oy"}, {"job_title": "HTML5 Game Programmer ", "date": "2019-01-23 18:17:51.0", "description": "HTML5 Game Programmer, Barona Oy, Barona IT Oy, Helsinki. HTML5 Game Programmer, Barona Oy, Helsinki , Haku päättyy: 12. 02. 2019 klo 23: 59, kokoaikatyö, Kesto: yli 12 kuukautta Paf Game Studio is looking for a Game Programmer with passion to games. You are self-motivated, goal-oriented and a strong team player. You can visualize how things should work, and how to translate this into a functioning solution. You take pride in your work and know what it means to take responsibility and deliver quality focused products. Come to work in a team of professionals that drives th. . . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "Barona Oy"}, {"job_title": "Java Developer ", "date": "2019-04-02 14:30:06.0", "description": "FINNPLAY Technologies is a Finnish software development company specialized in applications for the online gaming industry with customers across Europe, North America and Asia. Our passion is to create the best user experience by applying state-of-the-art technologies. Founded in 2008, Finnplay specializes in developing real money gaming platforms and solutions for the iGaming industry and caters to start-ups as well as large established companies looking to replace existing legacy gaming systems or improve them. Familiarize with Finnplay and our team at http: //www. finnplay. com . Finnplay is now looking for a great Java Developer to join our passionate team based in downtown, Helsinki. You will work on online gaming portal solutions, which include web site development as well as payment and game provider integrations. You have ability to understand business requirements and translate them into technical requirements and solutions. As a member of team a commitment to collaborative problem solving, sophisticated design, and quality product is important. Our organization encourage to innovate and develop new solutions in fascinating environment. We also offer an opportunity to work in our Malta office. Your responsibilities will be: Designing, implementing and maintaining Java applications Writing well-designed, efficient and testable code Conducting software analysis, programming, testing and debugging. What we expect from you: Relevant studies (e. g. computer science, information technology) Minimum 3 years solid experience of Java developing Developing experience of web-based systems Understanding of OOPs concepts and patterns Familiar with Spring, Hibernate, Struts Familiar MySQL, Linux Understanding Docker Fluent communication skills in English. Did you interested? Please send your CV and a short application letter to taina. sopenlehto@finnplay. com. Apply quickly! We proceed with the best candidates immediately!", "company": ""}, {"job_title": "Java Developer ", "date": "2019-04-02 14:30:06.0", "description": "FINNPLAY Technologies is a Finnish software development company specialized in applications for the online gaming industry with customers across Europe, North America and Asia. Our passion is to create the best user experience by applying state-of-the-art technologies. Founded in 2008, Finnplay specializes in developing real money gaming platforms and solutions for the iGaming industry and caters to start-ups as well as large established companies looking to replace existing legacy gaming systems or improve them. Familiarize with Finnplay and our team at http: //www. finnplay. com . Finnplay is now looking for a great Java Developer to join our passionate team based in downtown, Helsinki. You will work on online gaming portal solutions, which include web site development as well as payment and game provider integrations. You have ability to understand business requirements and translate them into technical requirements and solutions. As a member of team a commitment to collaborative problem solving, sophisticated design, and quality product is important. Our organization encourage to innovate and develop new solutions in fascinating environment. We also offer an opportunity to work in our Malta office. Your responsibilities will be: Designing, implementing and maintaining Java applications Writing well-designed, efficient and testable code Conducting software analysis, programming, testing and debugging. What we expect from you: Relevant studies (e. g. computer science, information technology) Minimum 3 years solid experience of Java developing Developing experience of web-based systems Understanding of OOPs concepts and patterns Familiar with Spring, Hibernate, Struts Familiar MySQL, Linux Understanding Docker Fluent communication skills in English. Did you interested? Please send your CV and a short application letter to taina. sopenlehto@finnplay. com. Apply quickly! We proceed with the best candidates immediately!", "company": ""}, {"job_title": "JavaScript Developer ", "date": "2018-01-11 18:52:43.0", "description": "JavaScript Developer, aTalent Recruiting, Helsinki, Haku päättyy: 21. 01. 2018 klo 23: 59, kokoaikatyö, Fulltime, (Part-time can be negotiable if you still have some studies left), Kesto: yli 12 kuukautta, PermanentAre you keen to work with modern web technologies such as JavaScript and React? Do you want to help develop a mobile game for an untapped global B2B market? Viking Theories is now looking for a JavaScript Developer to join their team! Type: Full-time, permanentSuitable background: End of Studies-GraduatedWorking hours: Fulltime, (Part-time can be negotiable if you still have some studies left). . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "aTalent Recruiting"}, {"job_title": "JavaScript Developer ", "date": "2018-01-11 18:52:43.0", "description": "JavaScript Developer, aTalent Recruiting, Helsinki, Haku päättyy: 21. 01. 2018 klo 23: 59, kokoaikatyö, Fulltime, (Part-time can be negotiable if you still have some studies left), Kesto: yli 12 kuukautta, PermanentAre you keen to work with modern web technologies such as JavaScript and React? Do you want to help develop a mobile game for an untapped global B2B market? Viking Theories is now looking for a JavaScript Developer to join their team! Type: Full-time, permanentSuitable background: End of Studies-GraduatedWorking hours: Fulltime, (Part-time can be negotiable if you still have some studies left). . . <keywords>Helsinki, Erityisasiantuntijat, </keywords>", "company": "aTalent Recruiting"}]